{"vote": "3", "verified": true, "reviewTime": "12 19, 2012", "reviewerID": "A1KKWETTT5BZ6N", "asin": "B00474S1J2", "reviewText": "My dentist recommended this as a relaxation technique for dental visits. They give me an ipod with headphones, play this on it and it relieves some of the stress of dental treatment, which I dislike intensely.\nIt worked so well that I bought my own copy to try at home. I fall asleep after a couple of minutes and stay asleep. Instead of tossing and turning, I hardly move at all. Highly recommend.", "summary": "Out like a light!", "unixReviewTime": 1355875200, "sentiment": "positive", "id": 0}
{"verified": true, "reviewTime": "03 3, 2017", "reviewerID": "AQO27CEUXMPDJ", "asin": "B004753IZI", "style": {"Format:": " Audio CD"}, "reviewText": "The Cd cover was broken when I got it", "summary": "Two Stars", "unixReviewTime": 1488499200, "sentiment": "negative", "id": 2}
{"vote": "2", "verified": true, "reviewTime": "12 5, 2010", "reviewerID": "A2ULLFQLKX1B37", "asin": "B0029LD85M", "style": {"Format:": " MP3 Music"}, "reviewText": "\"Rainbow\" was a hard album for me to review. I love Johnny Cash, and to give anything that he has done less than 4 stars is tough for me. \"Rainbow\" was released in 1985 and was Cash's last album for Columbia. Veteran Memphis producer Chips Moman was given the honors this time around. Chips Moman had produced some incredible R&B hits, as well as bringing Willie Nelson to the masses with \"Always on my Mind.\" However, this pairing doesn't work as well.  The material is weak and some quite ill-suited for Cash. \"Easy Street\" sounds contrived as Johnny Cash tries to relate to being a millionaire who's having a bad day. PLEEEEZ. On \"Love Me Like You Used To\" Cash sounds as bored singing it as I did listening to it. Sad. The album has three real good moments though. The opener \"I'm Leaving Now\" is a great lead track that Cash wrote about \"The System\" not a woman. Cut two is Kris Kristofferson's \"Here Comes That Rainbow Again\" which is an uplifting story told well. Cash's cover of CCR's \"Have You Ever Seen the Rain\" stands out also. This was the last digital download I needed to complete my collection. Now you know why.", "summary": "NO GOLD for RAINBOW", "unixReviewTime": 1291507200, "sentiment": "negative", "id": 7}
{"vote": "5", "verified": false, "reviewTime": "04 14, 2010", "reviewerID": "AJ8CBMFSPRKQU", "asin": "B0029LD85M", "style": {"Format:": " MP3 Music"}, "reviewText": "This was the very last original album from Johnny Cash to be released on Columbia records, after you listen to it you'll see why. A few good gems are on this, like his version of the CCR classic \"Have you ever seen the rain?\" but all in all this album is just lame. BUT I will say this......he then signed to Mercury records and made 5....yes 5 totally awesome CDs!  Buy all 5 of those merucry releases......1. Johnny cash is coming to Town....2. Water from the Wells of Home....3. Classic Cash '88 (re-recordings of his big hits)....4. Boom-chicka-Boom.....5. The Mystery of Life.", "summary": "the Album that made Columbia records dump the man in Black", "unixReviewTime": 1271203200, "sentiment": "negative", "id": 8}
{"verified": false, "reviewTime": "03 6, 2014", "reviewerID": "AE2X30STEHHY8", "asin": "B00476B1HO", "reviewText": "I thoroughly enjoyed the Battlefield rendition of the series' many games' different themes. Battlefield 2 and Bad Company being the most prominent, the sequences are very well integrated and recording quality is amazing.\n\nThe reason for 4 stars instead of 5 is the very long, and very odd section of percussion only, about halfway through the song. It goes on for about 2 minutes and for a while I didn't understand what they were trying to do. I then figured that it was probably their attempt at the Battlefield 3 and 4 theme. But no, it's not. The album came out even before Bad Company 2 did... It doesn't ruin the overall experience entirely, but it was something that bothered me that I thought was worth noting. Otherwise, it's a great piece!", "summary": "Great Battlefield series medley!", "unixReviewTime": 1394064000, "sentiment": "positive", "id": 9}
{"verified": false, "reviewTime": "05 5, 2011", "reviewerID": "A15Z2947ZA5TJF", "asin": "B00476GSEU", "style": {"Format:": " MP3 Music"}, "reviewText": "I had the displeasure of listening to this song while listening to Lex and Terry. They had the singer on, Josie, interviewing him and whatnot over the phone, then they played this song. Horrible horrible song. Repetitive, generic, corporate metal? Can I even call it metal? Terrible song.", "summary": "Awful", "unixReviewTime": 1304553600, "sentiment": "negative", "id": 10}
{"verified": true, "reviewTime": "05 23, 2016", "reviewerID": "A1C7ZFU2BOBUZF", "asin": "B0047BBJ3K", "style": {"Format:": " MP3 Music"}, "reviewText": "Had the songs I wanted on it", "summary": "Four Stars", "unixReviewTime": 1463961600, "sentiment": "positive", "id": 25}
{"verified": true, "reviewTime": "09 6, 2014", "reviewerID": "A2IRES7FJLJ53F", "asin": "B0019GAAZO", "style": {"Format:": " MP3 Music"}, "reviewText": "I like it but then I never wanted to hear it again, just got so old right away!", "summary": "nahh...", "unixReviewTime": 1409961600, "sentiment": "negative", "id": 32}
{"verified": true, "reviewTime": "01 15, 2017", "reviewerID": "AU279UYS43IDI", "asin": "B0047C1KHO", "style": {"Format:": " MP3 Music"}, "reviewText": "I bought this digital download (I would rather have a physical CD!) because I love some of Joe Hisaishi's music from watching a few of Miyazaki's cartoons.  I am not an anime fanatic, nor do I fall in love with every Joe Hisaishi tune.  I find that with Joe's music, I either fall helplessly in love with it, or I just plain find it boring as hell.  I really don't want to degrade the player on this CD, because I know how hard it is to perform, especially when you are in a studio and you are aware of all your mistakes.  This player is good, plays all the right notes.  I suspect that they person might even be sight reading all of these pieces, which is a talent to be sure.  Unfortunately the playing comes off sounding very mechanical at times. Either way, there are some real gems on this album.  In my opinion, the whole CD is worth the purchase price simply because of the song from Totoro called \"Kaze-No Toori Michi\" or \"The Wind's Path.\"  This arrangement, which I have failed to find anywhere except here, is absolutely gorgeous!!  Whoever arranged this is simply brilliant!  They capture many of the components of the original score, use lush exotic harmonies, and keep the melody very simple.  The introductory repetitive left hand passage keeps the piece moving giving it an undercurrent of longing, sadness, or maybe just expressing the unbiased non-emotional qualities of nature and the wind?  I don't know, but it reminds me of what a progressive rock keyboardist might do with it like Keith Emerson, or Eddie Jobson.  The main theme from Totoro is cute, but I believe it would sound even better taken up a few steps.  It's played without the happy qualities that it should be played with, and again, very mechanical.  Regardless, I did give it 5 stars because it has many redeeming qualities.", "summary": "RELAXING? MOSTLY. BORING? SOMETIMES. WORTH BUYING? YES!", "unixReviewTime": 1484438400, "sentiment": "positive", "id": 37}
{"verified": true, "reviewTime": "12 24, 2014", "reviewerID": "A7J5L33R31N0W", "asin": "B0047D8S28", "reviewText": "Ira and the crowd - what more need I say?", "summary": "Worth an hour of your life. Maybe two or three.", "unixReviewTime": 1419379200, "sentiment": "positive", "id": 48}
{"verified": true, "reviewTime": "07 24, 2015", "reviewerID": "A2EKS8VCM8AYFR", "asin": "B0047E16S0", "style": {"Format:": " MP3 Music"}, "reviewText": "Never got it!", "summary": "One Star", "unixReviewTime": 1437696000, "sentiment": "negative", "id": 49}
{"vote": "2", "verified": true, "reviewTime": "12 23, 2012", "reviewerID": "A22VGP03I2PEUK", "asin": "B0047GL55C", "style": {"Format:": " MP3 Music"}, "reviewText": "This works great in a spoof of a horse throwing it's long mane around.  The song is so awful it's hysterical.", "summary": "bought this as a gag for a friend", "unixReviewTime": 1356220800, "sentiment": "negative", "id": 58}
{"verified": true, "reviewTime": "12 21, 2015", "reviewerID": "A327UMW4BYEWH5", "asin": "B0047JTSM6", "reviewText": "what does it mean to be in the middle of nowhere? What constitutes 'somewhere'? First world pondering.", "summary": "Five Stars", "unixReviewTime": 1450656000, "sentiment": "positive", "id": 62}
{"verified": true, "reviewTime": "03 6, 2016", "reviewerID": "A3FXREFGOSVWJR", "asin": "B0047K2Z7A", "style": {"Format:": " MP3 Music"}, "reviewText": "It says explicit, but I didn't hear any cursing at all. This song rocks HARD. Loved it.", "summary": "An Alter Bridge great", "unixReviewTime": 1457222400, "sentiment": "positive", "id": 64}
{"verified": true, "reviewTime": "12 29, 2011", "reviewerID": "A2JZPEW49WB9KN", "asin": "B0047MAO08", "reviewText": "I am open minded and found different interpretations of the bible entertaining to listen to however, it may offend some people. The story telling, journalism and reporting is excellent. If your not easily offended by alternative points of view about the bible I would recommend it.", "summary": "Interesting perspective on the Bible", "unixReviewTime": 1325116800, "sentiment": "positive", "id": 71}
{"verified": false, "reviewTime": "12 14, 2015", "reviewerID": "A2R0H26Q281K8E", "asin": "B0047TGO0K", "style": {"Format:": " MP3 Music"}, "reviewText": "This song is perhaps the most annoying peice of sh*t I have ever heard!", "summary": "Turn it OFF!", "unixReviewTime": 1450051200, "sentiment": "negative", "id": 78}
{"verified": false, "reviewTime": "12 14, 2015", "reviewerID": "A2R0H26Q281K8E", "asin": "B0047TGO0K", "style": {"Format:": " MP3 Music"}, "reviewText": "This song is perhaps the most annoying peice of sh*t I have ever heard!", "summary": "Turn it OFF!", "unixReviewTime": 1450051200, "sentiment": "negative", "id": 79}
{"verified": true, "reviewTime": "05 22, 2014", "reviewerID": "AR9S9SS1XEWOF", "asin": "B0047VGN2M", "reviewText": "Original was better in my opinion. The remix just isn't what I think of when I think of Irish music.", "summary": "Remix", "unixReviewTime": 1400716800, "sentiment": "negative", "id": 87}
{"verified": false, "reviewTime": "03 4, 2014", "reviewerID": "A1MCZZE9L9LPDX", "asin": "B0047VGN2M", "reviewText": "this remix is terrible...  Heard the original and loved it, this is just bad...  Really bummed as I love the music and the song but just couldn't do this.", "summary": "Love Macklemore and Ryan Lewis but....", "unixReviewTime": 1393891200, "sentiment": "negative", "id": 88}
{"verified": true, "reviewTime": "06 29, 2015", "reviewerID": "A35X9XFM36K37S", "asin": "B0047VFGPC", "reviewText": "Love the son but I download ad it and can't find it so I had to go to play store on my phone and download a music downloader", "summary": "Love the son but I download ad it and can't ...", "unixReviewTime": 1435536000, "sentiment": "negative", "id": 91}
{"verified": true, "reviewTime": "11 22, 2015", "reviewerID": "AS5LJQ52L6HBF", "asin": "B0047WR4Y2", "style": {"Format:": " MP3 Music"}, "reviewText": "Good album", "summary": "Overkill", "unixReviewTime": 1448150400, "sentiment": "negative", "id": 93}
{"verified": false, "reviewTime": "08 8, 2014", "reviewerID": "A20GFPRVC9ESJL", "asin": "B0047XJSKY", "style": {"Format:": " MP3 Music"}, "reviewText": "I have heard better recordings of this song.  Try this one \"Stay with me\" another great Jose song.", "summary": "Two Stars", "unixReviewTime": 1407456000, "sentiment": "negative", "id": 95}
{"verified": true, "reviewTime": "02 14, 2018", "reviewerID": "A3N051DRLM8UOX", "asin": "B0047ZPZ9A", "style": {"Format:": " MP3 Music"}, "reviewText": "Just my preference-nothing will replace the original.", "summary": "Two Stars", "unixReviewTime": 1518566400, "sentiment": "negative", "id": 108}
{"verified": true, "reviewTime": "07 30, 2017", "reviewerID": "A2LAIS9RSLIIJU", "asin": "B0047ZPZ9A", "style": {"Format:": " MP3 Music"}, "reviewText": "its fake!", "summary": "One Star", "unixReviewTime": 1501372800, "sentiment": "negative", "id": 109}
{"verified": true, "reviewTime": "05 16, 2017", "reviewerID": "A1HBRMO4GD50X", "asin": "B004808G9A", "style": {"Format:": " MP3 Music"}, "reviewText": "Fun at first. Then devolves into gibberish. Being at The Cotton Club in the roaring 20's would have been all time epic tho.", "summary": "not so much.", "unixReviewTime": 1494892800, "sentiment": "negative", "id": 123}
{"verified": true, "reviewTime": "10 23, 2015", "reviewerID": "A7LO6PRHZLP0H", "asin": "B00480ACLK", "style": {"Format:": " Audio CD"}, "reviewText": "Wrote the wrong review for Pieces, which I got at the same time as the cd for Begin.  My review of Begin under the Millenium Pieces cds said this was nice and clear, with a mix that was not as complicated as the vinyl I had over 40 years ago.  The Pieces cd is demos and works in progress that never made it to release.  Not as complicated but a simpler Begin (ing).  Both are good cds.", "summary": "My review of Begin under the Millenium Pieces cds said this was nice and clear", "unixReviewTime": 1445558400, "sentiment": "positive", "id": 131}
{"verified": true, "reviewTime": "06 13, 2016", "reviewerID": "A3ESTP6KVBACOC", "asin": "B00480AIWS", "style": {"Format:": " MP3 Music"}, "reviewText": "Love this song but waste of 1.29 it won't play or download to my phone!", "summary": "One Star", "unixReviewTime": 1465776000, "sentiment": "negative", "id": 132}
{"verified": false, "reviewTime": "07 11, 2012", "reviewerID": "A3QS1EPDZTLPWS", "asin": "B004811W0E", "style": {"Format:": " Audio CD"}, "reviewText": "Luke Vibert's first release under his own name, A POLISHED SOLID, for the famed Mo Wax label, are three cuts of abstract hip-hop. The title track brings in some sax, but those disappear under layers of EQ sweeps and a looped sample saying, \"Oh, Christ.\" Meanwhile, \"Radart\" sort of meanders in a pleasing way, and \"Frogs Belly\" lets loose the jazz, with a tinge of Wagon Christ cheekiness. An auspicious start.", "summary": "Luke Vibert '- A Polished Solid", "unixReviewTime": 1341964800, "sentiment": "positive", "id": 133}
{"vote": "3", "verified": false, "reviewTime": "04 28, 2011", "reviewerID": "A2LKR8IAK5JP79", "asin": "B00481854A", "style": {"Format:": " Audio CD"}, "reviewText": "This CD is a British London Records version of the original mono \"Pat's Great Hits\" with 2 bonus tracks added - \"When The Swallows Come Back to Capistrano\" and \"Louella\". I used to have that LP, and the speed was quite correct. However, at least the Mp3 samples here at Amazon are awfully slow. So, before buying the CD, make sure it sounds at normal speed.  You can also look for the \"Greatest Hits\" CD which contains 8 original mono tracks from \"Pat's Great Hits\" plus other great songs. As for myself, I made a CDR compilation of all Pat Boone main original Dot Records albums from 2 box sets of the Bear Family \"Pat Boone, The 50's Complete\" and \"The Sixties, 1960-1962\".", "summary": "How Slow Can You Go, Volume 2", "unixReviewTime": 1303948800, "sentiment": "negative", "id": 136}
{"verified": false, "reviewTime": "08 10, 2016", "reviewerID": "A102E3D2MHLHSI", "asin": "B00481IUDQ", "reviewText": "Love the idea of this cd. But it's hard to understand the singers... Even after reading the lyrics I had a hard time picking out the names of the presidents and their wives in the songs... They should've slowed it down and made it more clear, and it may confuse some kids since a lot of the names are run the names together.", "summary": "Love the idea of this cd", "unixReviewTime": 1470787200, "sentiment": "negative", "id": 143}
{"verified": true, "reviewTime": "02 23, 2011", "reviewerID": "A1EW1OILI6AGGC", "asin": "B00485AJA4", "style": {"Format:": " Audio CD"}, "reviewText": "Vocalion is a pretty neat label. They're re-issuing and rescuing some great tunes from the vinyl graveyard. I own several of their CDs. Love the music on this one, but it's got a very muffled sound. The volume setting is out of line with other songs in my WMP \"playlists\". So I have go turn up the volume then quickly turn it down again when the song is over. Be easier to nix it from my playlists, but then I'd never hear it.", "summary": "Beautiful Music Marred By Muffled Sound", "unixReviewTime": 1298419200, "sentiment": "negative", "id": 147}
{"verified": true, "reviewTime": "07 2, 2014", "reviewerID": "A19BHL58FTMLFL", "asin": "B00485GB4M", "reviewText": "Norman Luboff's arrangements of American music have been a delight to me since my high school days in the '50s, and are a large part of the reason I began composing and arranging songs myself about thirty years ago.  This disc is a terrible example of Luboff's work.  The tracks I was interested in hearing are of numbers that he arranged magnificently, and these are NOT those arrangements.", "summary": "Norman Luboff's arrangements of American music have been a delight to me since my high school days in the ...", "unixReviewTime": 1404259200, "sentiment": "negative", "id": 150}
{"verified": true, "reviewTime": "09 6, 2012", "reviewerID": "A1LHBDWA13C2ND", "asin": "B00489SCKY", "style": {"Format:": " MP3 Music"}, "reviewText": "Giggles & laughter while singing some of these with my dad, not having a clue to the real meanings at the time.", "summary": "Entertaining memories from childhood", "unixReviewTime": 1346889600, "sentiment": "positive", "id": 153}
{"verified": true, "reviewTime": "06 16, 2014", "reviewerID": "A2VS8VSWFFEIER", "asin": "B0007LY3Z0", "style": {"Format:": " Audio CD"}, "reviewText": "music to my soul, precious treasure. thank i could not enjoy it if you did not sell it,xo xo xo", "summary": "music to my soul", "unixReviewTime": 1402876800, "sentiment": "positive", "id": 162}
{"verified": true, "reviewTime": "10 20, 2017", "reviewerID": "AHY1M9QW1YZ4X", "asin": "B0048W2HES", "reviewText": "I bought this because I love Which One's Pink - Other bands weren't so good", "summary": "One Star", "unixReviewTime": 1508457600, "sentiment": "negative", "id": 176}
{"verified": true, "reviewTime": "06 10, 2011", "reviewerID": "A3BJ241JWY6B9S", "asin": "B0048W95OI", "style": {"Format:": " MP3 Music"}, "reviewText": "Funny, I've seen two different collections from Jill Corey and both are missing the only hit she had. It was called \"Love Me To Pieces\", out in the early 50's, and you'd think whoever put this and the other collection out would have known and included it with the other songs. Jill is best at upbeat songs,this CD is half and half, I don't care for the slow stuff, but this was the way the original was released. However by omitting that one song, which was a Huge hit, this CD is just missing a spark.", "summary": "\"Good singer- But where's her only Hit \"", "unixReviewTime": 1307664000, "sentiment": "positive", "id": 187}
{"verified": true, "reviewTime": "03 29, 2016", "reviewerID": "A3B98K1PFC2QG3", "asin": "B0048VXC52", "style": {"Format:": " MP3 Music"}, "reviewText": "I thought I had heard all their songs but not this one.  I listened to it for an hour the first time I heard it just recently. Remarkable. Just plain loved it and had to buy it.", "summary": "soft sands and time...", "unixReviewTime": 1459209600, "sentiment": "positive", "id": 189}
{"verified": true, "reviewTime": "01 9, 2018", "reviewerID": "A1YK9ZOFTDRJG3", "asin": "B0048Y6HWY", "style": {"Format:": " MP3 Music"}, "reviewText": "Not sure why this version was not very popular.  Beautiful arrangement of an old classic from my childhood.", "summary": "Hard to compete with an old classic but Mariah pulled it off!", "unixReviewTime": 1515456000, "sentiment": "positive", "id": 196}
{"verified": false, "reviewTime": "04 10, 2011", "reviewerID": "A1DE4LXKS46AGU", "asin": "B0048ZJVLM", "style": {"Format:": " Audio CD"}, "reviewText": "\"This product is manufactured on demand using CD-R recordable media. Amazon.com's standard return policy will apply.\"\n\n1. I'm happy to hear that Wright is alive and possibly this is a new album..\n\n2. I'm baffled though because WHY doesn't the likes of Wright have a record deal to manufacture factory made cd's??\n\n3. Is this a bootleg?? or is it just a compilation of unreleased stuff???\n\n(Approach with caution, however 'Nard' fans will buy it regardless.. like me!)", "summary": "is it official? Does it matter?? Bernard Wright RULES!!! Thanks for the reissue...", "unixReviewTime": 1302393600, "sentiment": "positive", "id": 206}
{"verified": false, "reviewTime": "01 1, 2011", "reviewerID": "A25T9FCJNE5O0K", "asin": "B00491ID8M", "reviewText": "What happens when you assign a bunch of contributors to write all new Christmas stories?\n\nYou get this podcast.\n\nThat's what it felt like, anyway.  What if Mary Magdalene was a modern sixth grader?  What was Joseph's life like after Mary got pregnant?  Assign moderately talented writers to find out.  Don't expect too much.\n\nThis isn't up to TAL's usual standards.", "summary": "By-the-numbers...snore", "unixReviewTime": 1293840000, "sentiment": "negative", "id": 216}
{"verified": true, "reviewTime": "01 25, 2018", "reviewerID": "A1U6TTW734UDS", "asin": "B00491RQNK", "reviewText": "It wasn't the Ferdinand the Bull song I remember as a child.", "summary": "The movie might be better", "unixReviewTime": 1516838400, "sentiment": "negative", "id": 222}
{"vote": "3", "verified": false, "reviewTime": "02 19, 2012", "reviewerID": "A5KM00GFSWJCJ", "asin": "B00491KGBO", "style": {"Format:": " MP3 Music"}, "reviewText": "I love vocaloid (mostly Kagamine songs)!!!!!!!!! I can't belive I found a Rin Kagamine hall of fame single on amazon mp3. I thought vocaloid albums and singles were only available on itunes... Guess I was wrong. But I can't buy it yet... Amazon, please include more vocaloid albums and singles on here! I have recommendations for you. They are:\n\n-Magnet by Hatsune Miku and Luka Merguine ( if that's how you spell it )\n-Jabberwocky Jabberwocka by Rin and Len Kagamine\n-Iroha Uta by Rin Kagamine\n\nI have more, but it's an extremely long list. Still, love the song!!\n\nP.S. Sorry if I have spelling errors, I'm only OK at spelling ( in my opinion )", "summary": "OH MY GOD!!!!", "unixReviewTime": 1329609600, "sentiment": "positive", "id": 224}
{"vote": "11", "verified": false, "reviewTime": "07 6, 2004", "reviewerID": "A3TXKGNOAJ4117", "asin": "B00491K0HO", "style": {"Format:": " Audio CD"}, "reviewText": "Imagine: Guitars that blaze with no reserve, while at the same time keeping the good riffs alive. Drums that stay simple but never let up. Skillful, reverberated vocals that melt steel(e). That certain air about an album that makes the discerned listener think \"80's!\" and throw up the horns instinctively....\nThese things were part of a style of metal that's now considered stale, untalented, retro, and anything else of the like to many people, shamefully many who are serious fans of metal. The style is straight up meat-and-potatoes heavy metal with no frills and no apologies. A forgotten flag proudly carried in the past by bands like Judas Priest, Iron Maiden, Accept, Queensryche, Saint, W.A.S.P., Stormwitch, Fifth Angel....and Sacred Warrior. Make no mistake, Sacred Warrior's debut, Rebellion, is not black metal, death metal, technical progressive algebra metal, beach metal, astral techno Jupiter moon metal, carpenter metal, symphonic metal, core-metal, coffee mug metal, or anything else except guitar heavy, scream filled, in your face American traditional/power metal in the vein of the masters. In other words, this 1988 album serves as a great reminder of just why most metal fans got into metal in the first place. The songs here are simple, but extremely hooky, and always chock full of ultra great, over the top guitar playing and singing. There'll be no sheep heads flying off the stage, no deep nihilistic misanthropic whitebread message, no 'artful' avante garde snobbiness, no crap at all to be found. What there will be is a lot of banging of head due to the solid songwriting to be found here and trying to sing along with vocalist Rey Parra, a criminally overlooked belter in the style of Geoff Tate and Michael Kiske who can easily hold his own with the giants.\nAlthough there is a bit of variation in the overall quality of the songs on Rebellion, there are no real weak ones at all. There is a silly moment or two, such as in the opener, Black Metal - which doesn't seem to have a single thing to do with black metal at all, but does have a good line or two denouncing conformity within metal ('You try so hard to be like everyone else'). A weak melody here and there is also present, but Rey Parra's signature vibrato-drenched screams at the end close it off on a good note. Aside from the B-grade opener every single song is a winner, with some more obvious highlights in some places. Roughly half the album can be classified in the latter group, starting with the third song, Mad, Mad World. This song is simply an unbelievable piece of hard rock influenced, galloping heavy metal. The vocal layering in the chorus is enough to make the song amazing on it's own, but there's also the shredding of guitarist Bruce Swift (easily one of the most underrated metal guitarists), the sledgehammer headbanging part after the second chorus, and some extra virtuosoic vocal work by Parra after the solo.. the man can almost be seen red-faced, singing so hard his vocal cords are sticking out of his throat. Even the lyrics (which speak out about the deceptive and superficial nature of society) are pretty great, which is a good thing. Not that the content itself of the album is bad - there are a lot of uplifting messages of encouragement (Children of the Light, title track), warning (Master of Lies, Stay Away from Evil), and glorification of Jesus Christ (every song). The band's lyric writing ability is simply somewhat pedestrian on this album, so while there is always at least one good line to be found, overall the lyrics are almost too simple and minimalistic. Thankfully, however, they never get awkward or silly, except for a little bit in the aforementioned Black Metal, with the chorus sporting the line, 'Long hair, parted between the eyes/Silk pants, wrapped tight round your thighs/Each day goes by, you're living a dream'. Yes, there's no questioning that it was 1988...\nGoing back to the rest of the songs, not each song is the best of them, but every song has at least one great <i>defining</i> moment in it (usually the chorus) that really helps make the song, which is why Rebellion is such a solid album. Then, some songs are just top quality, such as Mad, Mad World, Stay Away From Evil, which is a shorter song but has some good riffwork and one of the more infectious choruses to be found, Famine, a mid paced song that harkens directly back to Number of the Beast/Piece of Mind era Iron Maiden and features Rey Parra doing his very best Geoff Tate impersonation, and The Heavens are Calling, another galloper with some fiery solos and more catchy vocal work. The interesting thing about the chorus vocals on this album - like on The Heavens are Calling - is that many times instead of singing different verses with a set melody, there will be only one or two actual lines in the chorus, but introduced by 'general' vocalizations, like a 'Whooaaa, ohh ohhh', which helps give Rebellion a refreshing flair. There is also Children of the Light and Master of Lies, both excellent speed metal songs with big chorus hooks carried by Parra's huge vocal range and Bruce Swift laying down riff after riff and solo after solo. On a small negative note, the drums sound a bit odd on the faster songs - that's not to say that Tony Velazquez does a bad job behind the drumkit, but the drums just seem to be more engineered for the more midpaced, anthemic songs, and so when there's double bass pounding, the drum triggers stick out like a sore thumb. Of course, it could just be chalked up as part of the album's charm depending on your opinion.\nThe rest of the songs could be considered average, but not filler, which is important when an album has only 11 songs or under. Regardless, there's still something incredibly cool about each one, like the big riff/solo set in the closer, Sword of Victory.\nRebellion is the kind of album everybody who enjoys metal should have at least a few of. There's nothing exactly like being refreshed with straight up well played heavy metal and that's what Sacred Warrior plays best.", "summary": "Essential, Classic American power metal", "unixReviewTime": 1089072000, "sentiment": "positive", "id": 226}
{"vote": "14", "verified": false, "reviewTime": "07 18, 2011", "reviewerID": "A3A99DKC62GAX0", "asin": "B004928L2E", "style": {"Format:": " MP3 Music"}, "reviewText": "I know my \"helpful\" rating will suffer from the title ... but come on .. you know it is accurate.  After first listen I thought this song was creepy. Next listen and I was thinking more comical.  Third listen and yeahhhhh it's kinda creepy, and that is without even looking at the cover art.  Decrepit lady sings of a lost distant love over a simple repeated guitar line, but toward the end a nice chorus of background angels come in to somewhat rescue this song.", "summary": "Love song from great great grandma suffering from dementia", "unixReviewTime": 1310947200, "sentiment": "negative", "id": 230}
{"verified": true, "reviewTime": "03 5, 2016", "reviewerID": "A4VH0LSXEUYNQ", "asin": "B00492EOAW", "style": {"Format:": " MP3 Music"}, "reviewText": "I might give a better review if I can ever find out how to actually listen to it.", "summary": "Sux!!!!! Waste of money.....cant find download anywhere.", "unixReviewTime": 1457136000, "sentiment": "negative", "id": 239}
{"verified": false, "reviewTime": "11 11, 2010", "reviewerID": "A3RVSS07VEXQVE", "asin": "B004948NOS", "style": {"Format:": " MP3 Music"}, "reviewText": "Cee-Lo is a bit of an odd character. He starts off the song with a monologue about how unique he is and lives by no rules. Then he moves into the meat of the song.  Although this is a #1 rated song on many lists, I can't recommend it. It is meandering and really didn't catch me at all. You shoudl take a listen to the preview and see what you think but I just don't think it is that good.", "summary": "Lady Killer is not a Killer Song", "unixReviewTime": 1289433600, "sentiment": "negative", "id": 241}
{"verified": false, "reviewTime": "11 1, 2007", "reviewerID": "A1ZYFMCQTVGSNT", "asin": "B000QL9C20", "style": {"Format:": " MP3 Music"}, "reviewText": "Wave of Sand fulfills the central purpose of what a new age song is supposed to do, i.e., send the listener to a serene place.", "summary": "Quintessentially New Age", "unixReviewTime": 1193875200, "sentiment": "positive", "id": 243}
{"verified": true, "reviewTime": "08 18, 2015", "reviewerID": "A2E6KHM9KPIBL1", "asin": "B0049ACXZW", "style": {"Format:": " MP3 Music"}, "reviewText": "Disappointed", "summary": "Two Stars", "unixReviewTime": 1439856000, "sentiment": "negative", "id": 249}
{"verified": true, "reviewTime": "08 22, 2017", "reviewerID": "AQ2GD0FH26DW9", "asin": "B0049QS5Z8", "style": {"Format:": " MP3 Music"}, "reviewText": "Competent but not with the inspiration and joy such a great and wonderful work deserves.", "summary": "Two Stars", "unixReviewTime": 1503360000, "sentiment": "negative", "id": 261}
{"verified": false, "reviewTime": "11 30, 2014", "reviewerID": "A1WOS7YKID3GO4", "asin": "B0049QRKKO", "style": {"Format:": " MP3 Music"}, "reviewText": "Mastered from an inferior LP pressing.", "summary": "Mastered from an inferior LP pressing.", "unixReviewTime": 1417305600, "sentiment": "negative", "id": 276}
{"verified": true, "reviewTime": "10 27, 2015", "reviewerID": "AOZR7Q3ZH2TFK", "asin": "B0049SEVJA", "style": {"Format:": " MP3 Music"}, "reviewText": "I like her voice, is excellent. What I don't like is the lyric.", "summary": "Two Stars", "unixReviewTime": 1445904000, "sentiment": "negative", "id": 285}
{"verified": false, "reviewTime": "02 21, 2014", "reviewerID": "AX4R32J404D4E", "asin": "B001B871LQ", "style": {"Format:": " MP3 Music"}, "reviewText": "I am not a polka person, but this song strikes a funny cord with me.  I am from Minnesota so saying Ya  is an everyday thing here.\nThis song has a lot of Ya's in it so it sounds so Minnesotan.", "summary": "Love this song", "unixReviewTime": 1392940800, "sentiment": "positive", "id": 289}
{"verified": true, "reviewTime": "05 8, 2015", "reviewerID": "A12QZUCL46Z0TI", "asin": "B0049TSLXG", "style": {"Format:": " Audio CD"}, "reviewText": "Select something else if you like Latin Music as this is a bust.", "summary": "Two Stars", "unixReviewTime": 1431043200, "sentiment": "negative", "id": 293}
{"verified": true, "reviewTime": "02 7, 2012", "reviewerID": "AVR9BHU8V2T1F", "asin": "B0049URQ0E", "style": {"Format:": " MP3 Music"}, "reviewText": "One of Maynard Ferguson's least jazzy albums was also one with the greatest general appeal. Some very pretty ballads and nice arrangements. The sound of this download version, however, is poorer than I could have made myself by running my old LP through commercial conversion software. This was made from a very worn LP with less than adequate conversion software, in my opinion. You may want to wait until a more sonically pure version is offered.", "summary": "Should have been weeded out by Amazon.com", "unixReviewTime": 1328572800, "sentiment": "negative", "id": 297}
{"verified": true, "reviewTime": "04 5, 2013", "reviewerID": "A3UXTZBPMI2GQC", "asin": "B0049YG70U", "style": {"Format:": " MP3 Music"}, "reviewText": "I loved the music, but was disappointed by the fact that I was unable to separate the tunes, which are back-to-back on this CD/MP3 complilation. That means I am unable to select the tunes individually, either as MP3s or as a CD which I had planned to burn. Also the fact that there are no details of recording dates or personnel. Apart from Cannonball Adderley, Johnny Coles and Gil Evans, I would have like to know who the rest of the band members were, particularly the trombone player who takes a solo. but these are minor complaints compared with the affordable cost.", "summary": "Great music, but no track separation...", "unixReviewTime": 1365120000, "sentiment": "positive", "id": 308}
{"verified": true, "reviewTime": "05 19, 2012", "reviewerID": "AT48SZC2VRDZT", "asin": "B0049YL6TC", "style": {"Format:": " MP3 Music"}, "reviewText": "I sent for the song \"song of India\" by Mario Lanza, I have listen to this song for over 50 years. It is one of my favorite songs.what you sent me is not by Mario Lanza. I have it on an LP.otherwise I am very happy with the rest of the music you have sent me.", "summary": "NOT Mario Lanza ...", "unixReviewTime": 1337385600, "sentiment": "negative", "id": 312}
{"verified": true, "reviewTime": "01 3, 2018", "reviewerID": "A2PYEYA9R8SC35", "asin": "B0049Z4F3K", "reviewText": "This recording has only 4 of the 6 stanzas. An incomplete song rendition. WTH!", "summary": "Only 2/3 of the Song?", "unixReviewTime": 1514937600, "sentiment": "negative", "id": 316}
{"verified": false, "reviewTime": "12 7, 2010", "reviewerID": "A2GAB06BKRMOIY", "asin": "B0049Z4F3K", "reviewText": "The preview for \"Good King Wenceslas\" showed me that they left out some of the lyrics. I'm disappointed, and certainly will get neither this song nor this album.", "summary": "Good King Wenceslas-Missing Lyrics!", "unixReviewTime": 1291680000, "sentiment": "negative", "id": 317}
{"verified": true, "reviewTime": "12 4, 2011", "reviewerID": "A1Y3A0O4G6WW8J", "asin": "B0049Z2RFI", "style": {"Format:": " MP3 Music"}, "reviewText": "Many years ago I had and 8 track tape of the Morman Tab. choir---This was my favorite song and I have wondered many times about it. Now I find that what I came up w here is nothing the same---unrecognizable. Dont want it and am trying to give it back!", "summary": "not  the same", "unixReviewTime": 1322956800, "sentiment": "negative", "id": 320}
{"verified": true, "reviewTime": "02 5, 2016", "reviewerID": "A1NWKTRT21SOD8", "asin": "B0049Z44ZE", "reviewText": "The actual title of the song is When Day is Done (not Gone).  Smooth as silk, Clint delivers a very romantic song in a vintage style that gets your heart yearning for that special someone.", "summary": "Pure Vintage Romance", "unixReviewTime": 1454630400, "sentiment": "positive", "id": 324}
{"vote": "3", "verified": false, "reviewTime": "11 18, 2010", "reviewerID": "A3W4D8XOGLWUN5", "asin": "B004A3GMMS", "style": {"Format:": " MP3 Music"}, "reviewText": "When it does come down to it, the cast of Glee has done some really pathetic covers. When I heard them recently do a cover of Whitney Houston's I Look To You, I really thought that they just really killed the rawness and the intimate appeal of the song. They've done the same idea when they've mixed two rock classics together into one song, by mixing Bon Jovi's Livin' On A Prayer, and the classic Rolling Stones anthem Start Me Up, it feels like the killjjoy of 2 die hard fans into one badly made opus. It feels like the songs from the Rock Of Ages musical feel like a better novelty to listen to than what the cast of Glee has done with beautiful songs. I also think the producers of Glee should try and deliver more original songs than the feeling of covers being more like gags with crescent rolls.\n\nSong: F-", "summary": "Not Even For Bon Jovi & A Rolling Stone", "unixReviewTime": 1290038400, "sentiment": "negative", "id": 339}
{"verified": true, "reviewTime": "06 9, 2011", "reviewerID": "A1OROIUGWI6YPE", "asin": "B004A43FJ0", "style": {"Format:": " Vinyl"}, "reviewText": "Christmas Bells, with organist Richard Keys Biggs, is a rare find nowadays in any format.  It originally appeared in the 50s on a monaural LP (Capitol T-9013).  It is that edition which I found at Amazon (Sold by Looney Geeks).  Given the rarity of the recording, one must be prepared to accept pops and crackles, and there are a goodly sprinkling of those throughout both sides.  The sound, of course, is typical of the early days of high fidelity.  That said, the record is well worth owning if you can find a copy.  The carols are played with deep and heart-felt simplicity, with no fancy arranging.  The chimes are very well used to accentuate the simple directness of Biggs' interpretations of a goodly selection of the most beloved carols.  The only drawback with regard to the copy I received is that it was plainly advertised as an audio CD (which obviously it is not).  I had fully expected the item to be a remake by someone from the original vinyl, and am somewhat disappointed that such was not the case.  By and large, though, the quality of the disc is quite acceptable although the price ($24.95) iwas a bit steep, given that the disc is not in pristine condition.  Nevertheless, if you can find one, BUY IT!", "summary": "Rare Christmas Treasure", "unixReviewTime": 1307577600, "sentiment": "positive", "id": 352}
{"vote": "9", "verified": false, "reviewTime": "04 1, 2011", "reviewerID": "A14PIQ73YSO7DP", "asin": "B004A8IT7E", "style": {"Format:": " MP3 Music"}, "reviewText": "This is a rare, and beautiful album of orchestral magic which George Melachrino recorded in stereo for the wonderful RCA in 1958. This is part of a set of several albums he did for RCA including Music for: Reading, Relaxation, Dining and so on, and were some of RCA's very FIRST popular stereo albums (LSP 1000,1001,1002).... WELL, one's hopes are dashed. This is a bad needle drop transfer, and tracks 2-6 have been so badly recorded that they are not listenable. What is this Hallmark company, and WHAT are they doing?  I suggest a few weeks with Mike Dutton to learn how to do PROPER musical transfers. The musical material merits 5 STARS, the transfer 0,  so it has to get a 2.", "summary": "Unbelievable", "unixReviewTime": 1301616000, "sentiment": "negative", "id": 358}
{"verified": true, "reviewTime": "03 19, 2011", "reviewerID": "A3HKCFUS9TYB1F", "asin": "B004A90ADO", "style": {"Format:": " Audio CD"}, "reviewText": "I couldn't believe Amazon is selling this.  This is CLEARLY A HOME-MADE TYPE COVER and SONG LISTING - and ITUNES DOESN'T EVEN RECOGNIZE SONGS - ITunes just lists TRACK #s.  What's going on?!", "summary": "HOME MADE RIP-OFF???", "unixReviewTime": 1300492800, "sentiment": "negative", "id": 360}
{"verified": true, "reviewTime": "12 23, 2014", "reviewerID": "A3AIF1PGFTI67U", "asin": "B00122PHIK", "style": {"Format:": " MP3 Music"}, "reviewText": "It simply wouldn't open in Windows 7.", "summary": "Wouldn't open", "unixReviewTime": 1419292800, "sentiment": "negative", "id": 363}
{"verified": true, "reviewTime": "05 1, 2014", "reviewerID": "A2FOTGQUQJMCLR", "asin": "B004ABYQD2", "reviewText": "Although I've heard this music performed by an orchestra almost every Christmastime, the Quartetto Gelato version is a delightfully different and spirited rendition of this classic portion of The Nutcracker Suite.  As usual, the quality of Amazon's download is superior to any CD or DVD recording.", "summary": "The Quartetto Gelato version is a delightfully different and spirited rendition of this classic portion of The Nutcracker Suite.", "unixReviewTime": 1398902400, "sentiment": "positive", "id": 385}
{"verified": true, "reviewTime": "02 21, 2014", "reviewerID": "AP7J7DD5FAHV8", "asin": "B004AC5CRK", "reviewText": "Cause it's a pretty song and I had been looking everywhere for this song when I found it on Amazon I just had to have it so glad you had it.", "summary": "found my song", "unixReviewTime": 1392940800, "sentiment": "negative", "id": 391}
{"verified": true, "reviewTime": "09 28, 2017", "reviewerID": "ANQLSBFK4O667", "asin": "B004AC5A86", "style": {"Format:": " MP3 Music"}, "reviewText": "This is what I didn't need", "summary": "One Star", "unixReviewTime": 1506556800, "sentiment": "negative", "id": 394}
{"verified": true, "reviewTime": "10 10, 2014", "reviewerID": "A2DSYKN8UH4SYN", "asin": "B004AC1ERW", "reviewText": "No complaints", "summary": "Five Stars", "unixReviewTime": 1412899200, "sentiment": "positive", "id": 401}
{"vote": "2", "verified": false, "reviewTime": "12 26, 2012", "reviewerID": "A2LKR8IAK5JP79", "asin": "B004AE652E", "style": {"Format:": " Audio CD"}, "reviewText": "Smoke Dreams is one of my favorite records, and Ronnie Deauville was a great singer. But what you can hear on this CD and the identical iTunes album is an absolutely unacceptable work. Processing the sound on my Mac, I had to increase the speed by 10% to match the real speed of my LP. And removing the clicks was a quite simple job to do, so I wonder why it couldn't be done when preparing this CD for release. If you are looking for this album, better try to find an original LP.", "summary": "Why Not Do It Properly?", "unixReviewTime": 1356480000, "sentiment": "negative", "id": 408}
{"verified": true, "reviewTime": "09 18, 2016", "reviewerID": "A3CLX56UE08WDZ", "asin": "B004AP05QU", "style": {"Format:": " MP3 Music"}, "reviewText": "It is only 52 seconds", "summary": "Short", "unixReviewTime": 1474156800, "sentiment": "negative", "id": 419}
{"verified": false, "reviewTime": "08 29, 2014", "reviewerID": "A2IOAPB5499ETF", "asin": "B004AQ04KQ", "style": {"Format:": " MP3 Music"}, "reviewText": "Great music, fuzzy sound quality. So, no dice on this one.", "summary": "Bad Sound Quality", "unixReviewTime": 1409270400, "sentiment": "negative", "id": 424}
{"verified": true, "reviewTime": "05 30, 2014", "reviewerID": "A2V11VNOLMF8Q7", "asin": "B004AQPH1C", "style": {"Format:": " MP3 Music"}, "reviewText": "I love live recordings but this one felt more like a hack job to me. It is early 70s and early in Springsteen's career so maybe I got what I paid for.", "summary": "so so", "unixReviewTime": 1401408000, "sentiment": "negative", "id": 445}
{"verified": false, "reviewTime": "01 14, 2015", "reviewerID": "AJM7VSM78T54J", "asin": "B004AQNVU6", "style": {"Format:": " MP3 Music"}, "reviewText": "ok just ok", "summary": "One Star", "unixReviewTime": 1421193600, "sentiment": "negative", "id": 447}
{"verified": false, "reviewTime": "11 28, 2014", "reviewerID": "A2SK59PG5TNAUZ", "asin": "B004AQWXTQ", "style": {"Format:": " MP3 Music"}, "reviewText": "I thought this was the original versionnot as good. Easy to understand the lyrics though which is nice for the kids when they are trying to sing along.", "summary": "I thought this was the original versionnot as good. Easy to understand the lyrics though which is ...", "unixReviewTime": 1417132800, "sentiment": "negative", "id": 454}
{"verified": true, "reviewTime": "10 27, 2015", "reviewerID": "A3PKVWTP7M6PDO", "asin": "B004AR6W9W", "style": {"Format:": " Audio CD"}, "reviewText": "This cd was shipped promptly and it was in excellent condition. Great! everything I expected . I was very pleased with this shipment.", "summary": "This cd was shipped promptly and it was in excellent condition. Great", "unixReviewTime": 1445904000, "sentiment": "negative", "id": 456}
{"verified": false, "reviewTime": "06 5, 2011", "reviewerID": "AOINAOO0NQRGN", "asin": "B004ASR3FS", "reviewText": "This soundtrack has perhaps the worst rendition of \"natural\" water pounds that I have ever heard. The alleged ocean waves are very static-y and sound more like fluctuating pink noise. The disturbing effects that are produced will more than negate any benefits from the gamma wave beat.", "summary": "Neither Natural Nor Authentic", "unixReviewTime": 1307232000, "sentiment": "negative", "id": 459}
{"verified": true, "reviewTime": "12 23, 2014", "reviewerID": "A3VY0Y0J93ZO59", "asin": "B004AST8FQ", "style": {"Format:": " MP3 Music"}, "reviewText": "This review features the song Night and Day, from the album:&nbsp;<a data-hook=\"product-link-linked\" class=\"a-link-normal\" href=\"/Vintage-Music-No-136-LP-Jo-Stafford/dp/B004ASZXFU/ref=cm_cr_arp_d_rvw_txt?ie=UTF8\">Vintage Music No. 136 - LP: Jo Stafford</a>\n\nBesides being a great melody this one captures the essence of Eros I thought.  I couldn't actually tell whether either of the versions of this song I've purchased is better quality.  Though the&nbsp;<a data-hook=\"product-link-linked\" class=\"a-link-normal\" href=\"/Broadway-Revisited/dp/B000XURADC/ref=cm_cr_arp_d_rvw_txt?ie=UTF8\">Broadway Revisited</a>&nbsp;version may potentially have been recorded at a more mature stage in her career, Jo's tonal skill and mastery of the melody lend an aura to this music on par with the original performed by Cole Porter.\n\nVintage Music includes assorted spirituals and pop selections alongside of the feature song.  One of them, in the Christmas spirit and particularly lovely is the soothing&nbsp;<a data-hook=\"product-link-linked\" class=\"a-link-normal\" href=\"/Star-Of-Hope/dp/B004AST8DI/ref=cm_cr_arp_d_rvw_txt?ie=UTF8\">Star Of Hope</a>&nbsp;.  Best wishes for Christmas and the year to come.", "summary": "Patsy sang like Jo", "unixReviewTime": 1419292800, "sentiment": "positive", "id": 460}
{"verified": true, "reviewTime": "10 31, 2014", "reviewerID": "A2BU8PP8HVDAY4", "asin": "B004ASUANK", "style": {"Format:": " MP3 Music"}, "reviewText": "Can't understand anything he's saying", "summary": "so much reverb", "unixReviewTime": 1414713600, "sentiment": "negative", "id": 465}
{"verified": false, "reviewTime": "09 1, 2012", "reviewerID": "A283BJKXJVEZ9E", "asin": "B004AUE2NW", "style": {"Format:": " MP3 Music"}, "reviewText": "The above reviews have to be from relatives.  She is enthusiastic but the voice needs a LOT of training.  Amateur at best. I've heard better listening to karaoke (even at the end of the night when everyone is drunk).", "summary": "Seriously?", "unixReviewTime": 1346457600, "sentiment": "negative", "id": 486}
{"verified": true, "reviewTime": "03 8, 2015", "reviewerID": "A2OV9V7XG1GI72", "asin": "B004AUYGJW", "style": {"Format:": " MP3 Music"}, "reviewText": "Daughter likes - but awful music in my opinion.", "summary": "2 Stars", "unixReviewTime": 1425772800, "sentiment": "negative", "id": 499}
{"verified": false, "reviewTime": "09 6, 2011", "reviewerID": "A3G547A56610X", "asin": "B004AV0A2S", "style": {"Format:": " MP3 Music"}, "reviewText": "I've been a huge fan of Caedmon's Call for nearly a decade.  They're music was simply superior to any other Christian group out there.  In the Company of Angels remains one of my favorite all-time albums of any band.\n\nBut I agree with another reviewer that I don't know where this band is going, and it isn't good IMO.  The music and lyrics of this album are inferior to past albums.  Cliff Young is their best singer, and he's not heard much.  And worse, they're heart for worship just isn't there anymore.\nCaedmon's Call --- if you read this review --- I love you guys for the great music over the past decade and more.  But this albums stinks.  Return to whatever you were doing and whoever you were working with, because I'm going to have to listen to the next album closely before I buy it.", "summary": "Disappointed", "unixReviewTime": 1315267200, "sentiment": "negative", "id": 501}
{"verified": true, "reviewTime": "11 24, 2013", "reviewerID": "A2300LGYNVSWOE", "asin": "B004AWBT86", "style": {"Format:": " MP3 Music"}, "reviewText": "typical of the recording in those days, the bass is in the back.  Used Audacity to tweak the EQ on it and it is fine now.....do not expect much under 100hz though", "summary": "not bad, for the era", "unixReviewTime": 1385251200, "sentiment": "positive", "id": 516}
{"verified": true, "reviewTime": "04 2, 2018", "reviewerID": "A1AVTB2FUWLS1P", "asin": "B004AWBWO2", "style": {"Format:": " MP3 Music"}, "reviewText": "Like many people, I bought several Badfinger numbers after viewing the finale of Breaking Bad.", "summary": "Nice", "unixReviewTime": 1522627200, "sentiment": "positive", "id": 517}
{"verified": true, "reviewTime": "04 30, 2018", "reviewerID": "AURCMN8ARCWVD", "asin": "B004B2VTJE", "style": {"Format:": " Audio CD"}, "reviewText": "bought for mom", "summary": "One Star", "unixReviewTime": 1525046400, "sentiment": "negative", "id": 532}
{"verified": false, "reviewTime": "03 30, 2011", "reviewerID": "A2BXYZJ9KRVOMQ", "asin": "B004B2GI4K", "style": {"Format:": " MP3 Music"}, "reviewText": "This is one of the most repetitive songs I have ever endured. It has a nice basic chill line, but who wants to hear it the whole song? Not me.", "summary": "Catchy, but very repetitive.", "unixReviewTime": 1301443200, "sentiment": "negative", "id": 546}
{"verified": true, "reviewTime": "09 15, 2015", "reviewerID": "ABON516U9SCX6", "asin": "B004B3FJWQ", "style": {"Format:": " MP3 Music"}, "reviewText": "too much rap", "summary": "Two Stars", "unixReviewTime": 1442275200, "sentiment": "negative", "id": 551}
{"verified": false, "reviewTime": "10 22, 2015", "reviewerID": "ACLEZ5I4RBM1C", "asin": "B004B3O7PQ", "reviewText": "I'm sure the cd is awesome but $70.00!!?? Wow.", "summary": "Prices are ridiculous.", "unixReviewTime": 1445472000, "sentiment": "positive", "id": 559}
{"verified": false, "reviewTime": "06 18, 2016", "reviewerID": "A1L8YJKQ2EBNLD", "asin": "B004B4JCSW", "style": {"Format:": " MP3 Music"}, "reviewText": "This is their only decent album for whatever reason.", "summary": "Best AC Album", "unixReviewTime": 1466208000, "sentiment": "positive", "id": 565}
{"verified": true, "reviewTime": "10 2, 2016", "reviewerID": "A1CBME49DPXA3R", "asin": "B004B4P1SM", "style": {"Format:": " MP3 Music"}, "reviewText": "Sucked. Hated it.", "summary": "Awful", "unixReviewTime": 1475366400, "sentiment": "negative", "id": 572}
{"verified": false, "reviewTime": "01 5, 2013", "reviewerID": "A65X09T4PFZ3X", "asin": "B004B5U9UG", "style": {"Format:": " MP3 Music"}, "reviewText": "I needed the BTVS theme song for a playlist on my iPod, and this is the song exactly as it's performed on the show.", "summary": "Exactly what I wanted.", "unixReviewTime": 1357344000, "sentiment": "positive", "id": 595}
{"verified": false, "reviewTime": "04 27, 2014", "reviewerID": "A1I4OAH5IZO32U", "asin": "B004B5XQN8", "style": {"Format:": " MP3 Music"}, "reviewText": "This MP3 has an unexceptable amount of background static. This is the first Mp3 download that has had this problem of many I have purchases.", "summary": "Has a Lot of Static", "unixReviewTime": 1398556800, "sentiment": "negative", "id": 598}
{"verified": true, "reviewTime": "07 24, 2016", "reviewerID": "A2NIURD7FDN5YR", "asin": "B004B5UG9K", "style": {"Format:": " MP3 Music"}, "reviewText": "Wouldn't let me use the song on face book", "summary": "One Star", "unixReviewTime": 1469318400, "sentiment": "negative", "id": 604}
{"verified": true, "reviewTime": "11 22, 2014", "reviewerID": "A2DURYIAN0OGFN", "asin": "B004B5W0W6", "style": {"Format:": " MP3 Music"}, "reviewText": "this has skip in it.", "summary": "skips", "unixReviewTime": 1416614400, "sentiment": "negative", "id": 607}
{"verified": true, "reviewTime": "05 13, 2016", "reviewerID": "A1LMSAWR7UEPMB", "asin": "B004B5ZIJ8", "style": {"Format:": " MP3 Music"}, "reviewText": "It was an ok  song", "summary": "One Star", "unixReviewTime": 1463097600, "sentiment": "negative", "id": 611}
{"verified": false, "reviewTime": "03 19, 2011", "reviewerID": "A1M2KVPOO9JCZH", "asin": "B004B6HKSE", "reviewText": "I bought this CD thinking the musician was the wonderful song writer/singer, author of Blue River and many other fine albums and songs. This is some young probably talented Billy Joel wannabe from Reno with his first CD. Neither the ad or the packaging have anything on them that suggest who this person is, which makes me suspicious. Disappointing; I was looking forward to something new from the \"original\" Eric Andersen.\nJohn Henry", "summary": "Not the \"Real\" Eric Andersen", "unixReviewTime": 1300492800, "sentiment": "negative", "id": 612}
{"verified": true, "reviewTime": "12 8, 2014", "reviewerID": "A37VUSB682WZEU", "asin": "B004B6LV5W", "reviewText": "its ok,", "summary": "smh its ok", "unixReviewTime": 1417996800, "sentiment": "negative", "id": 616}
{"verified": true, "reviewTime": "12 3, 2015", "reviewerID": "A1JC2D2T4DKZRO", "asin": "B004B6OSKW", "style": {"Format:": " MP3 Music"}, "reviewText": "I just don't seem to get tired of how tight the vocals are in this group. Nothing really new, however, it's just that simple consistent message we need to hear in gospel music from time to time.", "summary": "Great vocals", "unixReviewTime": 1449100800, "sentiment": "positive", "id": 625}
{"verified": false, "reviewTime": "02 8, 2014", "reviewerID": "A1ZURJE3IDFUF0", "asin": "B004B4W8QK", "style": {"Format:": " MP3 Music"}, "reviewText": "It gives the appearance of the song being edited but it is full of profanity! I was very very disappointed.", "summary": "not properly labled", "unixReviewTime": 1391817600, "sentiment": "negative", "id": 629}
{"verified": false, "reviewTime": "12 21, 2012", "reviewerID": "A1XXY2LNC2CW75", "asin": "B004B6LODQ", "reviewText": "I bought the MP3 of this track as a pre-Christmas tongue-in-cheek gift for my wife, who thinks this may be the worst Christmas song in many years.  Alas, radio stations here in Iowa love to play it.  Oh well.  (I have nothing against Mulberry Lane, who appear to be lovely young women.  It's just a really awful song.)", "summary": "Really dreadful", "unixReviewTime": 1356048000, "sentiment": "negative", "id": 632}
{"verified": true, "reviewTime": "09 26, 2013", "reviewerID": "AG05GEUITCY6Z", "asin": "B004B7O39W", "style": {"Format:": " MP3 Music"}, "reviewText": "Rocca really shines in this song, even PNO has some good verses (surprisingly). But Christian crisis, his verses are weak and boring, his flow is terrible and he shouldn't of even bothered to rap in it.", "summary": "Christian crisis is a terrible rapper.", "unixReviewTime": 1380153600, "sentiment": "positive", "id": 647}
{"verified": true, "reviewTime": "12 24, 2014", "reviewerID": "ALEL476C8W4AD", "asin": "B004BBI2B8", "reviewText": "Avoid the Remus it us loud and weird", "summary": "weird", "unixReviewTime": 1419379200, "sentiment": "negative", "id": 651}
{"verified": true, "reviewTime": "11 13, 2013", "reviewerID": "A1SB1FDK6AJBP2", "asin": "B004BC7YQ6", "style": {"Format:": " MP3 Music"}, "reviewText": "CAN NOT FIND THIS PRODUCT ANYWHERE CHEAPER. i TAKE THIS OVER THE COUNTER MEDICINE DAILY. I COULD GET A PRESCRIPTION FOR IT BUT WHY IT IS BETTER PRICED HERE", "summary": "PRICE IS EXCELLENT RAVED TO ALL MY FRIENDS ABOUT IT TO GET THIS PRODUCT FROM AMAZON.", "unixReviewTime": 1384300800, "sentiment": "positive", "id": 654}
{"verified": true, "reviewTime": "05 1, 2018", "reviewerID": "A3R70Y2UNTMDK9", "asin": "B004BC7MSQ", "style": {"Format:": " MP3 Music"}, "reviewText": "Can't really writ a review because I accidentally erased it! Grrr", "summary": "One Star", "unixReviewTime": 1525132800, "sentiment": "negative", "id": 657}
{"verified": true, "reviewTime": "06 22, 2017", "reviewerID": "A1U1YLXG2UTEVO", "asin": "B004BC7MSQ", "style": {"Format:": " MP3 Music"}, "reviewText": "Kid Rock needs to pull all of his music & have it destroyed. I was forced to purchase this & I hate myself for it.", "summary": "I was forced to purchase this & I hate myself for it", "unixReviewTime": 1498089600, "sentiment": "negative", "id": 659}
{"verified": true, "reviewTime": "07 28, 2013", "reviewerID": "A3TQ65EO2WNJ3U", "asin": "B004BC3M62", "style": {"Format:": " MP3 Music"}, "reviewText": "I love the song the Call, have ever since I heard it in the Narnia movie. However, this version of it isn't worth the money I paid. I think I am going to have to give up and buy the entire soundtrack just to get the studio version of this song.", "summary": "Love the Call, but Disappointed", "unixReviewTime": 1374969600, "sentiment": "negative", "id": 661}
{"verified": true, "reviewTime": "05 11, 2016", "reviewerID": "A27N86NW17Y1ZS", "asin": "B004BCM8GC", "style": {"Format:": " MP3 Music"}, "reviewText": "CANT PLAY IN MY CAR DUE TO YOUR IMPOSSIBLE APPLICATION.", "summary": "One Star", "unixReviewTime": 1462924800, "sentiment": "negative", "id": 666}
{"verified": true, "reviewTime": "05 4, 2015", "reviewerID": "A1IQV4GY77TJKU", "asin": "B004BD45T4", "style": {"Format:": " MP3 Music"}, "reviewText": "IT'S JUST A SIMPLE SONG D/LOAD... OF A SONG THAT I REALLY LIKE... NOT MUCH TO SAY ABOUT IT...", "summary": "OF A SONG THAT I REALLY LIKE..", "unixReviewTime": 1430697600, "sentiment": "positive", "id": 683}
{"verified": true, "reviewTime": "04 27, 2015", "reviewerID": "A330JGWHH90NSY", "asin": "B004BDF2FU", "reviewText": "1 song", "summary": "One Star", "unixReviewTime": 1430092800, "sentiment": "negative", "id": 686}
{"verified": false, "reviewTime": "12 30, 2014", "reviewerID": "A3ASYZ68JAJXK8", "asin": "B004BDJDIW", "style": {"Format:": " MP3 Music"}, "reviewText": "My daughter gave me this double CD for Christmas.  This is wonderful music to listen to, and La Maurache continues to be one of my favorite ensembles.  I only wish their albums were more readily available:  Their website lists two recordings that I do not even see on Amazon, one of which was recorded in 2005.", "summary": "Musica Cathedralis: Chartres, XIIIe Siecle", "unixReviewTime": 1419897600, "sentiment": "positive", "id": 689}
{"verified": true, "reviewTime": "10 14, 2013", "reviewerID": "A15TOFG0GASFW7", "asin": "B004BDQPMO", "style": {"Format:": " MP3 Music"}, "reviewText": "Say what you want about Southern Rock, redneck rock or whatever you want to call it. Molly Hatchet were one of the best overlooked bands from the late 70's and early 80's. This tune is an all time classic and one of the best songs ever written. The problem with this version is that it is not the original version. It is a re-recorded version that does not have Danny Joe Brown singing. Crappy re-mixing and I do NOT advise anyone to purchase this abomination. If you want to real song, you will have to find it somewhere else.", "summary": "One of the Greatest Songs Ever Written", "unixReviewTime": 1381708800, "sentiment": "negative", "id": 693}
{"vote": "4", "verified": false, "reviewTime": "01 2, 2013", "reviewerID": "AQ66GFQ1K4HPU", "asin": "B004BF78WI", "style": {"Format:": " MP3 Music"}, "reviewText": "There just aren't enough Xmas songs that have the word \"isthmus\" in them. Drew has delivered an (obviously) humorous take on the modern American Christmas spirit.", "summary": "F___ you if you don't like \"F___ You If You Don't Like Christmas\"", "unixReviewTime": 1357084800, "sentiment": "positive", "id": 697}
{"vote": "12", "verified": true, "reviewTime": "08 19, 2010", "reviewerID": "AEDE8DTYD94BS", "asin": "B004BH3MOY", "style": {"Format:": " Audio CD"}, "reviewText": "Pete Anders and Vinnie Poncia were prolific songwriters in the '60s and produced many of the Kama Sutra releases during that era which included their own performances under the names \"The Tradewinds\" and \"The Innocence.\"  They never toured or performed live as such, so these names were simply a foil to release their own material directly, rather than through other artists they were producing. Despite their generous output as writers, the biggest hit they had was \"New York is Lonely Town\" which only reached #33 on the Billboard charts. Kama Sutra records went bankrupt in the late '60s, the remnants of which morphed into Buddhah Records. The Tradewinds original vinyl LP, \"Excursions\" was very short in playing time, just over 12\" a side. In order to extend it to a more acceptable length for CD release, it now includes two tracks by The Good Times. Still, it only clocks in at just over 28\", which is very short for a CD.  Although produced by Anders and Poncia, The Good Times are a different group entirely from the Tradewinds.  (I should know, my brother, Tim, was the lead guitarist.) They had two singles on Kama Sutra and an unreleased album that was largely produced by the Anders-Poncia team.  On this Tradewinds CD, Pete and Vinnie wrote each track, including \"The Hard Life,\" but not \"That's When Your Heartaches Begin\", an old Elvis tune.  Although they produced this track, and Vinnie played piano on it, they neither wrote this song nor sang on it. These two tracks, along with \"New York's a Lonely Town\", are in mono, not stereo.  They may have been taken from the vinyl records, rather than the original masters. In my opinion, it would have been better to release the Tradewinds album and Innocence album together as a \"two for one\" combination for those interested in the Anders-Poncia writing team. That would have been a better value, and more honest.  In any case, The Good Times album, originally scheduled for release as KLPS 8052, remains in the vaults.", "summary": "Blending two groups into one!", "unixReviewTime": 1282176000, "sentiment": "negative", "id": 699}
{"vote": "3", "verified": true, "reviewTime": "12 12, 2010", "reviewerID": "A1FYQXPTUG2IP0", "asin": "B004BJOIZE", "style": {"Format:": " Audio CD"}, "reviewText": "This is, for the most part, some of the best and most beautiful music by some of the best boy choirs in the world.  However, I was extremely disappointed by the turn which the Vienna Boys' Choir seems to have taken.  The last four tracks (Nothing Compares to You, Eternal Flame, Burning Down the House and Only Time) are not at all in keeping with the great tradition this choir is known for.  These tracks, especially the ones by Prince and Talking Heads, are, in my opinion, deplorable.  These tracks should not be on this album at all, I don't think.  Choirboys from Heaven???  Sounds like Hell!!", "summary": "What Happened to the Vienna Boys' Choir???", "unixReviewTime": 1292112000, "sentiment": "positive", "id": 706}
{"verified": true, "reviewTime": "06 5, 2014", "reviewerID": "A2THRUQPQJXA0S", "asin": "B004BN7QVS", "reviewText": "Good voice, however with experience she flies!!  If you haven't listened to her lately, I would waste no time doing so!!", "summary": "No Comparsion to now", "unixReviewTime": 1401926400, "sentiment": "negative", "id": 718}
{"verified": false, "reviewTime": "12 21, 2014", "reviewerID": "A1367ZWDJLVNT0", "asin": "B004BR1HNM", "reviewText": "Castlevania never sounded so glorious.", "summary": "Five Stars", "unixReviewTime": 1419120000, "sentiment": "positive", "id": 726}
{"verified": true, "reviewTime": "04 30, 2016", "reviewerID": "A28JRU65P3IE7N", "asin": "B004BR8IRU", "reviewText": "I loved this song when I heard it in the video game trailer on youtube and the version by Peter Hollins and Malukah but in this version the guys singing it were really flat throughout the song.", "summary": "I loved this song when I heard it in the video ...", "unixReviewTime": 1461974400, "sentiment": "negative", "id": 732}
{"verified": false, "reviewTime": "12 8, 2017", "reviewerID": "A67B0ADR1T1FK", "asin": "B004BSCQAO", "style": {"Format:": " MP3 Music"}, "reviewText": "It's missing Jay-Z's 4th verse", "summary": "Missing part of the song", "unixReviewTime": 1512691200, "sentiment": "negative", "id": 752}
{"verified": true, "reviewTime": "09 5, 2017", "reviewerID": "A367T9OFYJTW6P", "asin": "B004BSCQAO", "style": {"Format:": " MP3 Music"}, "reviewText": "HORRIBLE AUDIO QUALITY", "summary": "One Star", "unixReviewTime": 1504569600, "sentiment": "negative", "id": 753}
{"verified": false, "reviewTime": "01 3, 2011", "reviewerID": "A1W16J9R4DOBEC", "asin": "B004BSDEM8", "style": {"Format:": " MP3 Music"}, "reviewText": "lil kim need to shut up her time was in the 90's so was foxy's. kim went to jail and hasdn't had a hiot in years she looks like michael jackson after a sex change and foxy's best album was ill na na she still has issues not a nicki fan but eminem makes this song tolerable.", "summary": "nicki disses lil kim", "unixReviewTime": 1294012800, "sentiment": "negative", "id": 760}
{"verified": true, "reviewTime": "01 12, 2015", "reviewerID": "ACLRH3SHX5YWB", "asin": "B004BSIKF4", "style": {"Format:": " MP3 Music"}, "reviewText": "There was a brief moment in time where I liked Kanye's music and bought this song. Then I realized he is a giant d-bag and represents everything that is wrong with modern hip-hop. Kanye is to music what Kim Kardashian is to television, utterly devoid of meaning or purpose. Steer clear of this garbage and go support some good music like Atmosphere, Grieves, Tupac, or Logic.", "summary": "Kanye is to music what Kim Kardashian is to television.", "unixReviewTime": 1421020800, "sentiment": "negative", "id": 775}
{"verified": true, "reviewTime": "12 12, 2012", "reviewerID": "AD8TS2S83FVU0", "asin": "B004BSIGOY", "style": {"Format:": " MP3 Music"}, "reviewText": "Love the song, cant find it on my phone, which sucks because I paid for it. It must be in the cloud somewhere", "summary": "Niki", "unixReviewTime": 1355270400, "sentiment": "negative", "id": 782}
{"verified": true, "reviewTime": "12 11, 2012", "reviewerID": "A130CGBPROCR7X", "asin": "B004BSK0CU", "reviewText": "This jig has a lot of character. Not just for the holiday but it has a certain history to it and I like instrumentals on my Christmas playlist, too.", "summary": "everyone needs to know it", "unixReviewTime": 1355184000, "sentiment": "positive", "id": 783}
{"verified": false, "reviewTime": "06 16, 2017", "reviewerID": "A3ILJS3Q5FGW7X", "asin": "B004BSJW60", "style": {"Format:": " MP3 Music"}, "reviewText": "sux ass sorry", "summary": "Pfff", "unixReviewTime": 1497571200, "sentiment": "negative", "id": 787}
{"vote": "2", "verified": false, "reviewTime": "08 31, 2012", "reviewerID": "A2GLWJP6OPZULX", "asin": "B004BSJBX4", "style": {"Format:": " MP3 Music"}, "reviewText": "5 Stars for great music - 2 Stars for bad word left in\n\nGreat energizing song that makes you just want to keep going.  However, even though it is edited and the nasty words are out you still can't play it in your car with the kids as the word A _ _ is left in.  Clean means \"Clean\" got it editors.  Now I got to go in and edit it myself.  Lose 3 stars for the inconvenience to still edit my own song.", "summary": "Edited Version still has the A_ _ word in the song.", "unixReviewTime": 1346371200, "sentiment": "negative", "id": 797}
{"verified": false, "reviewTime": "01 28, 2018", "reviewerID": "A3VFVJ5F9LXU3U", "asin": "B004BSKG2O", "style": {"Format:": " MP3 Music"}, "reviewText": "Worst album yet.", "summary": "One Star", "unixReviewTime": 1517097600, "sentiment": "negative", "id": 798}
{"verified": false, "reviewTime": "06 23, 2017", "reviewerID": "A2JU88NWWKYITM", "asin": "B004BSKG2O", "style": {"Format:": " MP3 Music"}, "reviewText": "Terrible excuse of a song", "summary": "There is better music", "unixReviewTime": 1498176000, "sentiment": "negative", "id": 799}
{"verified": false, "reviewTime": "02 24, 2013", "reviewerID": "A1DRKOUDLP80S7", "asin": "B004BTGXJ8", "style": {"Format:": " MP3 Music"}, "reviewText": "XXXXXXXXXX XXXXXXXXXXXXXX XXXXXXXXXXXXXX XXXXXXXXXXXXXX XXXXXXXX XXXXXXXXXX XXXXXXXXXXXX X This is a a lousy music  track. Don't bother. It blows big!", "summary": "I hated this track", "unixReviewTime": 1361664000, "sentiment": "negative", "id": 809}
{"vote": "2", "verified": false, "reviewTime": "06 17, 2011", "reviewerID": "A2TX79GR278JMA", "asin": "B004BTM0FO", "reviewText": "I have heard this song a lot lately, in various stores and pumping through the loudspeakers at the gym before I turn on my ipod.  It sounds like something that was designed by a committee to hit that perfect combination of catchy, trendy and completely inoffensive.  Somehow it's also gratingly annoying and sticks in your (your here being \"my\") head for days after it's been heard.  It's worse than \"It's A Small World After All.\"  Perhaps it's the familiarity of the \"Time Of My Life\" lyric that adds the hook, because the rest is comprised of a startlingly unoriginal dance track with generic lyrics about losing control on the dance floor and being freaky freaky, etc., which should, in theory, just blend in with the rest of the background noise.  I might just walk out of the next store where I hear this playing if I am near the exit and don't have a full cart of groceries which I will have to abandon. To the powers that be who decided to assault my ears with the repeated plays of this little gem, please, for the love of all that is good in the world, pick something else.", "summary": "Currently my least favorite song", "unixReviewTime": 1308268800, "sentiment": "negative", "id": 811}
{"verified": true, "reviewTime": "11 22, 2015", "reviewerID": "A37TWNNTNCY8JV", "asin": "B004BUD6OM", "reviewText": "ok", "summary": "One Star", "unixReviewTime": 1448150400, "sentiment": "negative", "id": 816}
{"verified": true, "reviewTime": "12 18, 2017", "reviewerID": "AZ0QLFHP6L6MB", "asin": "B004BUCSEQ", "style": {"Format:": " Audio CD"}, "reviewText": "She has had better", "summary": "Two Stars", "unixReviewTime": 1513555200, "sentiment": "negative", "id": 819}
{"verified": true, "reviewTime": "01 7, 2017", "reviewerID": "A1IQTY6MQP0WR1", "asin": "B004BUFER4", "style": {"Format:": " MP3 Music"}, "reviewText": "song", "summary": "Two Stars", "unixReviewTime": 1483747200, "sentiment": "negative", "id": 821}
{"verified": true, "reviewTime": "01 28, 2016", "reviewerID": "AVOF2TL7T400U", "asin": "B004BUCQC0", "style": {"Format:": " MP3 Music"}, "reviewText": "fun song", "summary": "Two Stars", "unixReviewTime": 1453939200, "sentiment": "negative", "id": 825}
{"vote": "4", "verified": false, "reviewTime": "12 10, 2010", "reviewerID": "A3IFIJNQ48DZPH", "asin": "B004BUF9RE", "style": {"Format:": " MP3 Music"}, "reviewText": "I was really excited to hear Sam Beam's newest creation mostly after seeing him live this fall and getting a preview of the upcoming album.  I took note when he covered \"Such Great Hights\" and instantly fell in love with his voice.\n\nWalking Far from Home is a brilliant track that finally seems to give Sam a voice instead of the whisper we all know and love.  And what a voice!  Even though the song is amazing, this track seems to be a little over mastered.  And sadly that continues to the other two.\nSummer in Savannah when played live has such depth to its sound.  Over-mastered and flat sound on the recording.\nHearing Biting your Tail this way scares me.\n\nThere is something big that these recordings are missing. I really hope that Sam Beam comes out with a LIVE ALBUM soon to show the world these songs' true colors and sound.", "summary": "oh, no.", "unixReviewTime": 1291939200, "sentiment": "negative", "id": 840}
{"verified": true, "reviewTime": "05 3, 2015", "reviewerID": "A2F9WPDCBKEFRX", "asin": "B004BVM606", "style": {"Format:": " MP3 Music"}, "reviewText": "Disappointing, there were a number of really good tracks from the cartoon show they omitted from this soundtrack!", "summary": "Disappointing", "unixReviewTime": 1430611200, "sentiment": "negative", "id": 842}
{"verified": false, "reviewTime": "02 21, 2012", "reviewerID": "A11OT9SRUZU6J6", "asin": "B004BWYSNI", "reviewText": "The song was lovely and perfect exactly as it was.  I was so disappointed when I heard the download sample.  Tragic.", "summary": "I agree", "unixReviewTime": 1329782400, "sentiment": "negative", "id": 849}
{"vote": "2", "verified": true, "reviewTime": "01 13, 2013", "reviewerID": "AY0BHMU1JWDMY", "asin": "B004BWZ57Q", "reviewText": "My house is next to 4 lanes of major-street traffic, and to mask the sound at night, others have suggested I get a box fan.  For the volume of a box fan's noise that I'd need, I didn't want the air flow that came with it.  I've tried a stand-alone white noise machine, but that particular one wasn't loud enough to mask anything, even on its highest volume.  So I looked for a CD of white noise or box fan sound effect.  Until I started looking, I didn't realize there were other \"colors\" of noise.  This was exactly what I was looking for.  It has a deeper or lower tone than white noise, so it doesn't sound as harsh, IMO.  I just wish I'd've found this cheap solution before I bought a box fan and a white noise machine!  I can still use the box fan, but the white noise machine is history now that I have this.", "summary": "Just what I was looking for", "unixReviewTime": 1358035200, "sentiment": "positive", "id": 851}
{"verified": true, "reviewTime": "03 29, 2013", "reviewerID": "A5G6RCHXDMT65", "asin": "B0010V9FUY", "reviewText": "This song claims there is more than one savior and creed there is only one WAY to be saved and that is through faith in what Jesus accomplished on the cross when HE took the punisment for our sins .Amen", "summary": "There is only ONE GOD ans SAVIOR", "unixReviewTime": 1364515200, "sentiment": "negative", "id": 858}
{"verified": false, "reviewTime": "01 17, 2013", "reviewerID": "A3DOYY9Q9GJPV0", "asin": "B001NW9HT4", "reviewText": "This singer, song wrighter is excellant, he has several CD's out but are hard to find.  They are not avaiable through major outlet.", "summary": "Need More of this artist's CD's", "unixReviewTime": 1358380800, "sentiment": "positive", "id": 863}
{"verified": true, "reviewTime": "08 30, 2016", "reviewerID": "A500D9W0BENQ5", "asin": "B004C9MCME", "style": {"Format:": " Audio CD"}, "reviewText": "Very little here...if your a Buddy Holly collector who must have everything recorded in his 1 1/2 years of fame...your really getting 3 songs here maybe 4 recorded in better than passable sound...the rest is fluff and not really essential or something you'd want to listen to in order to get pleasure but more of a scholary view...and i'm not condemning the CD by any means i encourage ALL Buddy Holly collectors to get this...i got it and will keep it but i can say there's not much here but i'll probably listen to it again and again...but the best tapes i ever heard were his apartment tapes.", "summary": "Buddy Holly Lives!", "unixReviewTime": 1472515200, "sentiment": "negative", "id": 869}
{"verified": false, "reviewTime": "10 7, 2015", "reviewerID": "A3UHWQI55CZNFV", "asin": "B004CA2PI4", "style": {"Format:": " MP3 Music"}, "reviewText": "Catchy song.", "summary": "Two Stars", "unixReviewTime": 1444176000, "sentiment": "negative", "id": 877}
{"verified": true, "reviewTime": "12 10, 2014", "reviewerID": "AUESKZI4UUOLD", "asin": "B004CAWM14", "style": {"Format:": " MP3 Music"}, "reviewText": "Would get 5 stars if not so auto tuned", "summary": "Four Stars", "unixReviewTime": 1418169600, "sentiment": "positive", "id": 888}
{"verified": true, "reviewTime": "07 22, 2015", "reviewerID": "A3QSO5UTCRYJAG", "asin": "B004CBMNJE", "reviewText": "It is played by Jimmy Shand, so one can not say anything more.  There are a number of recordings of this dance, all in strict tempo, and some have better sound, but Shand is the standard.", "summary": "Jimmy Shand, so what else can you say?", "unixReviewTime": 1437523200, "sentiment": "positive", "id": 900}
{"verified": true, "reviewTime": "10 17, 2016", "reviewerID": "AUZSGVS39YQ35", "asin": "B004CBSKG4", "style": {"Format:": " MP3 Music"}, "reviewText": "I want my money back only 1 good song but only well.", "summary": "Not worth it", "unixReviewTime": 1476662400, "sentiment": "negative", "id": 910}
{"image": ["https://images-na.ssl-images-amazon.com/images/I/61owXliMDxL._SY88.jpg", "https://images-na.ssl-images-amazon.com/images/I/51Axglrc7pL._SY88.jpg", "https://images-na.ssl-images-amazon.com/images/I/51MZNLERwkL._SY88.jpg"], "verified": false, "reviewTime": "09 3, 2011", "reviewerID": "A4YNNTV7UQ2U7", "asin": "B004CBQEYY", "style": {"Format:": " MP3 Music"}, "reviewText": "There's something to be said for an artist that still knows how to create imagery and take us on a guided tour of their inner workings and while they're at it, our own. At the first listen I said to my wife, \"Hey it's a new Neil (Young) song!\". Honestly, Mr. Will Clay does sound so eerily like Neil Young you almost can't believe that it isn't Neil. But, with as little as i know about the artist, I realized that it was more like a progressive version of Ole' Coyote Eyes (Neil) rather than a 'cop' of Neil's deal. What I did find out, I learned through Jango.com where Will has more than 1 song listed, thankfully (check it out, and while you're at it, check out Will Clay's song called 'Little Horn'...it's so real and spookey that it spun me back around again to the premise of Neil Young's 'Tonight's the Night' when he sings about the roadie with the \"'shakey voice...that sent a chill up and down'\" Neil's spine. That's the same chill that I get when I listen to Will Clay. Whoever Mr. Clay really is, I can't help but regard him as a true 'unknown legend'. Let's hear more!!! Some one needs to lasso this guy and get him into a studio, PRONTO! Geez!!", "summary": "Zen Radio - Perfect song?", "unixReviewTime": 1315008000, "sentiment": "positive", "id": 917}
{"verified": true, "reviewTime": "06 19, 2015", "reviewerID": "A1408J77C46LKY", "asin": "B004CBQX2C", "style": {"Format:": " Audio CD"}, "reviewText": "Got to be in the mood for old time rock-n-roll. Not good for quiet prayer time.", "summary": "Not good for quiet prayer time", "unixReviewTime": 1434672000, "sentiment": "negative", "id": 929}
{"verified": true, "reviewTime": "07 19, 2017", "reviewerID": "A2MGXRDKDD66DE", "asin": "B004CCX27U", "style": {"Format:": " MP3 Music"}, "reviewText": "Not a lot of people can make a guitar sing like that", "summary": "... a lot of people can make a guitar sing like", "unixReviewTime": 1500422400, "sentiment": "positive", "id": 942}
{"verified": true, "reviewTime": "07 22, 2014", "reviewerID": "A7PP0FBKIRMSG", "asin": "B004CE4WTA", "reviewText": "remixed version", "summary": "It's a Remix", "unixReviewTime": 1405987200, "sentiment": "negative", "id": 951}
{"verified": true, "reviewTime": "05 18, 2017", "reviewerID": "A253RHIPAN59Z0", "asin": "B004CE4VJ6", "style": {"Format:": " MP3 Music"}, "reviewText": "Good song", "summary": "Two Stars", "unixReviewTime": 1495065600, "sentiment": "negative", "id": 953}
{"verified": true, "reviewTime": "06 8, 2016", "reviewerID": "A8PPTH1XFBTZ8", "asin": "B004CEOS3A", "style": {"Format:": " MP3 Music"}, "reviewText": "Song skips twice in the being twice", "summary": "One Star", "unixReviewTime": 1465344000, "sentiment": "negative", "id": 967}
{"verified": false, "reviewTime": "02 18, 2016", "reviewerID": "AOY92YJEUID7S", "asin": "B004CEA6XG", "reviewText": "wtf", "summary": "Two Stars", "unixReviewTime": 1455753600, "sentiment": "negative", "id": 970}
{"verified": false, "reviewTime": "09 20, 2012", "reviewerID": "A2ZTGQXF6R39U", "asin": "B004CGE3YW", "reviewText": "I had heard the opening fragment of the first track 'Red House' somewhere and thought this promises to be an interesting, modern, arrangement of an eighteenth-century country dance. Buying the CD proved to be a big disappointment.  It is as though they do not think the melodies are able to stand on their own; from the very start of each track the tunes are decorated in, to my mind, a rather sickly fashion, where all the musicians must play something, however fragmented, all the time.  The pianist comes in for most of the blame here, vigorously scaling, arpeggiating and trilling all over the place so that the humbler wind and string players are relegated to the background even if they have the principal theme : not that the principal theme stays constant for very long as previously mentioned.  There is an overall impression of improvisation which, praiseworthy when done well, often results here in strange harmonies and overlaps which undermine the shape and feeling of the piece so that major or minor tonality has barely any effect.  Incessant decorative twiddles and runs of the piano in a higher register than the main theme trivialise all the pieces and become very tiresome thoughout.  The pianist is obviously a dominant member of the group and quite skilled, but should have been toned down in the recording for overall balance.  String and wind players play tiny irrelevant fragments when the piano has what should be a solo.  It seems as though they reach a consensus about a chord and as long as each plays something vaguely belonging to that chord it will be OK.  Inevitably, the rhythms suffer, indeed, are sometimes lost in this jumble.  As a country dancer of nearly 40 years experience I have survived many dances where live music has failed to live up to its expectation: this is the first commercially produced CD of country dance music I have bought which leaves me with the same feelings.", "summary": "Not to my taste", "unixReviewTime": 1348099200, "sentiment": "negative", "id": 973}
{"verified": false, "reviewTime": "04 17, 2011", "reviewerID": "A2UIOLW2U26MN", "asin": "B004CHP1LK", "style": {"Format:": " Audio CD"}, "reviewText": "Michael Milton\nThrough the Open Door (Music For Missions)\nReleased January 2011\nRobert Ham\nStyle: Acoustic folk/country; compare to Neil Young, Steven Curtis Chapman, Dan Fogelberg\n\nTop tracks: \"Eclogue for the Church Triumphant,\" \"Mississippi-Louisiana Line,\" \"The Gadarene\"\n\nIs there anything Michael Milton can't do? He's written numerous books, leads the Reformed Theological Seminary, and hosts a Bible study program on DIRECTV. And he has now released three CDs of plaintive spiritual folk that are musically opulent and emotionally stirring. Milton and his collaborators--including singer/songwriter Michael Card--have crafted an uncommonly varied set of songs, ably tackling bluegrass, lite rock, and country. It skews too heavily on the side of mellow, leisurely paced material, but still pulls off some unexpected moments like the arresting strings and piano that mark the closing track, \"Eclogue for the Church Triumphant,\" which, heard free of Milton's reading from Revelations 21:5, reminded me of no less than the Lou Reed/John Cale collaboration Songs for Drella.\n\nThis review is Copyright  2011 Christianity Today ([...])", "summary": "Christianity Today reviews Through the Open Door", "unixReviewTime": 1302998400, "sentiment": "positive", "id": 974}
{"verified": false, "reviewTime": "01 21, 2014", "reviewerID": "A3OZFX3GRWY03R", "asin": "B004CJU9RY", "style": {"Format:": " Vinyl"}, "reviewText": "Absolutely the best recorded performance of \"Gaite Parisienne\".  It bubble and sparkles like no other recorded performance.  Quality of the recording might be considered audiophile by some listeners.", "summary": "Sparkling Performance", "unixReviewTime": 1390262400, "sentiment": "positive", "id": 976}
{"verified": true, "reviewTime": "01 5, 2014", "reviewerID": "A25PEAE9W0T9V", "asin": "B004CQG2V4", "style": {"Format:": " MP3 Music"}, "reviewText": "It is good steady Blue Grass music. I would not put it on the super hits list, but it would wind up on most all standard play list.", "summary": "Its pretty good", "unixReviewTime": 1388880000, "sentiment": "positive", "id": 988}
{"verified": true, "reviewTime": "08 28, 2016", "reviewerID": "A3TL5FSESPI2FE", "asin": "B001BZDEEW", "style": {"Format:": " MP3 Music"}, "reviewText": "not one of the best", "summary": "Two Stars", "unixReviewTime": 1472342400, "sentiment": "negative", "id": 995}
{"verified": true, "reviewTime": "04 22, 2015", "reviewerID": "A2LSGWF4AKQWYB", "asin": "B004CT54CY", "reviewText": "None of these really work for me", "summary": "None of these really work for me", "unixReviewTime": 1429660800, "sentiment": "negative", "id": 999}
{"verified": true, "reviewTime": "02 19, 2011", "reviewerID": "A3SRFNO8RJSRDD", "asin": "B004CT9GD2", "reviewText": "I have listened to many brain wave CDs and like a lot of them.  But this one sounds very electronic and cold.  Good for the Borg, maybe, but not me.", "summary": "IRRITATING", "unixReviewTime": 1298073600, "sentiment": "negative", "id": 1003}
{"vote": "2", "verified": true, "reviewTime": "12 10, 2012", "reviewerID": "A1JZ39NQ95YJ2D", "asin": "B004CTABG8", "style": {"Format:": " MP3 Music"}, "reviewText": "This is a waste of my time.  I absolutely get nothing positive from the binaural beat stuff and I regret the purchase.", "summary": "Forgot that I don't like binaural beat brainwave", "unixReviewTime": 1355097600, "sentiment": "negative", "id": 1006}
{"verified": true, "reviewTime": "12 10, 2016", "reviewerID": "A2ZAG4YYMWYEJK", "asin": "B004CTCWMO", "reviewText": "Garbage", "summary": "Garbage", "unixReviewTime": 1481328000, "sentiment": "negative", "id": 1013}
{"vote": "2", "verified": true, "reviewTime": "03 19, 2012", "reviewerID": "A8TI4A5LLUADZ", "asin": "B004CTCWMO", "reviewText": "I prefer motivational Mp3s with suggestions vs subliminal.  I'll keep trying it, maybe I just haven't used it long enough. . .", "summary": "Not big on strict subliminals", "unixReviewTime": 1332115200, "sentiment": "negative", "id": 1016}
{"verified": true, "reviewTime": "11 16, 2016", "reviewerID": "A2YE7H0OB106WO", "asin": "B004CTFAWS", "style": {"Format:": " MP3 Music"}, "reviewText": "This is a lively, toe tapping Christmas song.  Can't help but sing a long with it.  The voices singing are smooth like honey!", "summary": "Love this Christmas song!", "unixReviewTime": 1479254400, "sentiment": "positive", "id": 1022}
{"vote": "2", "verified": true, "reviewTime": "11 18, 2012", "reviewerID": "A166AJIS01KE7S", "asin": "B004CUN68C", "style": {"Format:": " Audio CD"}, "reviewText": "I hyperventilated when Amazon emailed me about this CD. It was fortuitous. I had this CD, a gift my freshman year in college, that I kept on rotation so much that I wore it out. I have been searching for a new copy to call my own for about 7 years, looking everywhere. Not even Metropolis Records, the label, could help me. (Curious.) Of course I bought it about 45 seconds after I read my email. It arrived in a timely fashion and I have felt complete ever since. The only problem is that, for whatever reason. when I get to Track 3 (Project Pitchfork) the CD catches about halfway through the song (a real travesty) and I am unable to listen to the rest of it. It is strange because #1 the CD was still in the plastic when it arrived, #2 I have a boss CD player in my car, and #3 it is only at that certain part on this one CD. I have no problems with anything else I own. So, hmmm. Not enough to ruin my enjoyment. Overall I would absolutely buy this again. And again. And again, and you should too. Best compilation CD in the history of compilation CDs.", "summary": "Best Compilation in the Entire World", "unixReviewTime": 1353196800, "sentiment": "positive", "id": 1024}
{"verified": false, "reviewTime": "05 30, 2012", "reviewerID": "A1Y0HX12MCT6OR", "asin": "B004CWNFB8", "reviewText": "Having a party going a little too wild? Need everyone to get out? Never Fear! Just put this little gem on and people will start trampling over each other to get out. Want to break up with someone and don't know how? Just play this song in the car and Warning Signs will be blaring in your significant ex's head. Need to torture those pesky Taliban's for information? Just put this song on repeat and come back after a few hours and they'll tell you what kind of underwear their mother's wear!\n\nSpecial thanks to Angela Pivarnick's parents for raising a spoiled delusional bitch, because only someone like that is capable of pinching out a song that can only be described as the Zen of s***.", "summary": "Very Useful Song!", "unixReviewTime": 1338336000, "sentiment": "negative", "id": 1026}
{"verified": true, "reviewTime": "02 9, 2015", "reviewerID": "A16MI0K4BHH93C", "asin": "B004CXZM6I", "reviewText": "Due to microphone placement this recording brings out different orchestral voices that you usually do not hear. Makes listening (particularly with an orchestral score continually interesting. Varried tempi with wonderful soloists. Not the usual PERIOD piece recording but more a survey of a different time & style.", "summary": "Different than the H&H Society recording of the 70s", "unixReviewTime": 1423440000, "sentiment": "positive", "id": 1028}
{"verified": false, "reviewTime": "03 12, 2012", "reviewerID": "A3L2Z6XC0GSB8X", "asin": "B000XXUX1U", "reviewText": "Please be specific on this album... If you want to sell something, please show the songs that this album contains or maybe it's a secret!,thanks", "summary": "Lo machin del rock vol. 4", "unixReviewTime": 1331510400, "sentiment": "negative", "id": 1032}
{"verified": true, "reviewTime": "10 28, 2016", "reviewerID": "AX63R1J64FUP", "asin": "B004CYOVJQ", "style": {"Format:": " Audio CD"}, "reviewText": "This is an awesome collection for anyone going through loss of any kind.  Thanks Amazon for processing my multiple orders for this CD", "summary": "This is an awesome collection for anyone going through loss of any kind", "unixReviewTime": 1477612800, "sentiment": "negative", "id": 1036}
{"verified": true, "reviewTime": "10 8, 2016", "reviewerID": "A2Z2HFLB11Y7SK", "asin": "B004CZ6APS", "style": {"Format:": " Audio CD"}, "reviewText": "I was very disappointed with this CD set.  It sounded amateurish.  Having spent many years at Calvary Chapel Costa Mesa I've heard much better from Maranatha  Music.", "summary": "Disappointed", "unixReviewTime": 1475884800, "sentiment": "negative", "id": 1044}
{"verified": false, "reviewTime": "11 3, 2014", "reviewerID": "AQS4NALX78VIB", "asin": "B004D0MG5K", "style": {"Format:": " Vinyl"}, "reviewText": "I'm very annoyed, I ordered and I got a CD instead of a vinyl album!", "summary": "Utter Lies", "unixReviewTime": 1414972800, "sentiment": "negative", "id": 1046}
{"verified": true, "reviewTime": "02 2, 2012", "reviewerID": "A2Z6CQVRUQ4BOB", "asin": "B004D4YHEO", "style": {"Format:": " Audio CD"}, "reviewText": "I had no idea that I was paying $ 12.96 (includes shipping) for one (1) yes I said \"one (1)\" song!!! There is only one song on this CD. Although it is an excellent song and I thoroughly enjoyed the fact that she utilized the flute in the background music lending credibility to her \"roots,\" I cannot believe the charge for one song was over $10.00!", "summary": "Be In The Know...", "unixReviewTime": 1328140800, "sentiment": "negative", "id": 1060}
{"verified": false, "reviewTime": "06 29, 2009", "reviewerID": "A16SJTZ4QJMH7Z", "asin": "B001ME1KA2", "style": {"Format:": " Audio CD"}, "reviewText": "A pesar de que el concierto no fue malo, me di cuenta que no hay metales en las canciones (trombones y trompetas).  Esto es inconcebible para mi, los metales eran imitados por el tecladista, lo cual suena horrible.  Si Ruben hubiese incluido una seccion de metales en este concierto no hay duda de que hubiese sido un excelente CD.", "summary": "No hay metales senores", "unixReviewTime": 1246233600, "sentiment": "negative", "id": 1062}
{"verified": true, "reviewTime": "08 18, 2015", "reviewerID": "A2MIZS5D1G132Z", "asin": "B000SHID0E", "reviewText": "The shoes are comfortable to wear. I like the style of he boots. For the price can't go wrong. Delivery was earlier then expected also.  Thank you.", "summary": "The shoes are comfortable to wear", "unixReviewTime": 1439856000, "sentiment": "positive", "id": 1072}
{"verified": true, "reviewTime": "04 7, 2015", "reviewerID": "A203N7ZWO2D4H2", "asin": "B004DD3YF8", "style": {"Format:": " MP3 Music"}, "reviewText": "Long time Boston fan, Prefer Longtime only but not the way it works.", "summary": "Four Stars", "unixReviewTime": 1428364800, "sentiment": "positive", "id": 1092}
{"verified": false, "reviewTime": "03 2, 2017", "reviewerID": "A298TZ8CMZP8IH", "asin": "B0031G5C26", "style": {"Format:": " MP3 Music"}, "reviewText": "Stay out of Harms way.", "summary": "One Star", "unixReviewTime": 1488412800, "sentiment": "negative", "id": 1106}
{"vote": "3", "verified": false, "reviewTime": "11 15, 2011", "reviewerID": "A2W6Q16LE14CWK", "asin": "B004DETJ9W", "style": {"Format:": " MP3 Music"}, "reviewText": "I found this album among my parents' albums when I was a young child and listened to it over and over and over. I can't believe it's now available as an MP3 download. The quality of the music is spectacular, much better than the scratchy LP I wore down from repeated playing. Thank you for making this available!", "summary": "I Still Love This!", "unixReviewTime": 1321315200, "sentiment": "positive", "id": 1109}
{"verified": true, "reviewTime": "03 4, 2015", "reviewerID": "APZZBYSJZNI4C", "asin": "B004DF1OLC", "style": {"Format:": " MP3 Music"}, "reviewText": "like this song", "summary": "Two Stars", "unixReviewTime": 1425427200, "sentiment": "negative", "id": 1119}
{"verified": true, "reviewTime": "05 24, 2016", "reviewerID": "A29T1YK1BKEU29", "asin": "B004DHUA7Y", "style": {"Format:": " MP3 Music"}, "reviewText": "I like the Alison Kraus version a little better, but this is good too.", "summary": "Almost as good as Alison Kraus", "unixReviewTime": 1464048000, "sentiment": "positive", "id": 1135}
{"verified": true, "reviewTime": "09 4, 2014", "reviewerID": "ALSBU9298L34S", "asin": "B004DHUDZ8", "reviewText": "Sounded great in the ads.  However, it only has a partial program.  I was disappointed.  If you are just looking for a couple of minutes to get a flavor of old time radio, this will work.  If you are like me and want an entire program, this won't do it.", "summary": "Read the Fine Print", "unixReviewTime": 1409788800, "sentiment": "negative", "id": 1138}
{"verified": false, "reviewTime": "10 18, 2013", "reviewerID": "A233A9ZT9U04GG", "asin": "B004DJAKCC", "style": {"Format:": " MP3 Music"}, "reviewText": "how can you review an album if amazon won't let you hear it beats me but there you you go thats the  way it it", "summary": "listen an review , how", "unixReviewTime": 1382054400, "sentiment": "negative", "id": 1142}
{"verified": true, "reviewTime": "02 13, 2017", "reviewerID": "ACH6QNDRK3G41", "asin": "B004E30BY4", "style": {"Format:": " Audio CD"}, "reviewText": "El CD #1 esta defectuoso", "summary": "Five Stars", "unixReviewTime": 1486944000, "sentiment": "negative", "id": 1183}
{"verified": true, "reviewTime": "07 27, 2016", "reviewerID": "A2ZD4SAST1I4SQ", "asin": "B004E30BY4", "style": {"Format:": " Audio CD"}, "reviewText": "One of the CD's plays sometimes.", "summary": "Two Stars", "unixReviewTime": 1469577600, "sentiment": "negative", "id": 1184}
{"verified": true, "reviewTime": "04 7, 2017", "reviewerID": "A1T4ZJY28A7BYE", "asin": "B001MYXKU0", "reviewText": "Lenny Williams is classic. The background singers are off key.", "summary": "Four Stars", "unixReviewTime": 1491523200, "sentiment": "positive", "id": 1189}
{"verified": true, "reviewTime": "04 26, 2014", "reviewerID": "A36L3NRW858ROT", "asin": "B003NKYEBA", "style": {"Format:": " Audio CD"}, "reviewText": "Again.  I am starting to get as much exotica music as I can.  And also trying to get as much of Les Baxter's catalogue as I can.\n\nThe music is soothing, and sometimes exciting, but never dull.  As I have mentioned in previous reviews of Lex Baxter, I listen to a lot of his music on The Retro Cocktail Hour every Saturday night (even though it is actually two hours).\n\nNew to exotica?  Take the plunge and get this.", "summary": "Les comes through.", "unixReviewTime": 1398470400, "sentiment": "positive", "id": 1192}
{"verified": false, "reviewTime": "12 14, 2013", "reviewerID": "A13BLZ3PBU9N8O", "asin": "B003Z10FRE", "reviewText": "What an embarrassment to polyphonic singers everywhere. This is horrible...avoid at all costs. I wish I had never heard such nerve-wracking noise.", "summary": "Awful...worse than nails on a chalkboard.", "unixReviewTime": 1386979200, "sentiment": "negative", "id": 1200}
{"verified": true, "reviewTime": "10 3, 2011", "reviewerID": "A26K30OD6LTHO2", "asin": "B004EBTAZM", "style": {"Format:": " Audio CD"}, "reviewText": "Je ne peux &eacute;valuer ce produit ainsi que les 3 autres que j'avais commend&eacute;s en mme temps car je ne les ai pas reu. J'ai recu une boite vide , ouverte, contenant la feuille de commande mais aucun des articles command&eacute;s. Je comprend que ce n'est ni votre faute ni celle de l'exp&eacute;diteur mais vous auriez int&eacute;rt &agrave; v&eacute;rifier la comp&eacute;tence et l'honntet&eacute; de vos interm&eacute;diaires. Vous ne serez pas surpris si je diminue sensiblement mes commandes postales &agrave; l'avenir.", "summary": "empty", "unixReviewTime": 1317600000, "sentiment": "negative", "id": 1202}
{"verified": false, "reviewTime": "09 20, 2011", "reviewerID": "AOSXPAFAZLQV0", "asin": "B004ECJOAW", "style": {"Format:": " Audio CD"}, "reviewText": "I love Mary Mary and their past albums. This one was a little to the left for me.  It doesn't really sound like the soulful, Mary Mary ladies.  Let's do this one over please!", "summary": "Too R&B", "unixReviewTime": 1316476800, "sentiment": "negative", "id": 1216}
{"vote": "3", "verified": true, "reviewTime": "05 14, 2011", "reviewerID": "A2NA6VPXNOY5LR", "asin": "B004EDDBSC", "style": {"Format:": " MP3 Music"}, "reviewText": "Dev can be heard on Far East Movement's number one hit 'Like a G6', but didn't seem to gain much notoriety for her killer hook. She's here with her debut single, and doesn't seem to be trying to do anything but get a hit. Music purists won't look at this song twice, and it won't exactly gain her a cult following. However, the hook is just ridiculous, and the beat is so driving that this deserves to be a hit in clubs. Dev may have released a faceless pop track, but at least it's one of the most fun mainstream songs out right now.", "summary": "Unoriginal Fun", "unixReviewTime": 1305331200, "sentiment": "positive", "id": 1220}
{"image": ["https://images-na.ssl-images-amazon.com/images/I/71a5MhqbotL._SY88.jpg"], "vote": "2", "verified": true, "reviewTime": "10 28, 2017", "reviewerID": "A23X9QJTG9LYLQ", "asin": "B004EDQ3E6", "style": {"Format:": " Audio CD"}, "reviewText": "I was looking forward to getting this C.D ..I love Tom Petty & the Heartbreaks & I had to have this CD , But when I got the CD I was Very Very Disappointed in this Product I bought on Amazon It Does Not Play on Any CD Player ..Only on a Karaoke Machine . I think Amazon should Not by Any Means Sell Products that aren't Quality .. I Give this NO STARS at All .. NO STARS .. SHAME on you AMAZON. Com . I did go to Tom Petty & the Heartbreakers Very Last Show at the Hollywood Bowl on 9/25/17.. We have lost a Very Humble, Tallented , Singer / Songwriter & Person .. RIP Mr. Petty", "summary": "NO STARS .. Very Disappointed in AMAZON Products", "unixReviewTime": 1509148800, "sentiment": "negative", "id": 1221}
{"verified": false, "reviewTime": "01 26, 2012", "reviewerID": "A3LKG0FKZ1LF40", "asin": "B004EEECU2", "style": {"Format:": " MP3 Music"}, "reviewText": "Velma Frye's \"Take Heart\" is perfectly named. Her joyous songs renew the spirit and send it on an uplifting and peaceful journey.--Beth Appleton", "summary": "Heart and Soul", "unixReviewTime": 1327536000, "sentiment": "positive", "id": 1224}
{"verified": true, "reviewTime": "10 19, 2013", "reviewerID": "A19XEBVTDEJA1C", "asin": "B004EEFQAM", "reviewText": "I like how fun the track is.  Most of the album seems like the same thing, but this song is catchy.", "summary": "Cheeky", "unixReviewTime": 1382140800, "sentiment": "positive", "id": 1225}
{"verified": true, "reviewTime": "06 30, 2013", "reviewerID": "A1WEGGXHL85Z7R", "asin": "B004EEFQAM", "reviewText": "Skip this piece of **** ordered it because they played part on an episode of the good wife. Obviously they played the best part on the show.", "summary": "awful out of tune mess", "unixReviewTime": 1372550400, "sentiment": "negative", "id": 1226}
{"verified": true, "reviewTime": "01 11, 2013", "reviewerID": "A1CHLJQMZN8LHG", "asin": "B004EFFOTY", "style": {"Format:": " MP3 Music"}, "reviewText": "I love this song the same way I love, \"Criticize.\"  How his words in the songs blend with the melodies from the instruments.  He is really cute too, the same way as power house Luther Vandross', \"Glow of  Love\" for instance, Chuckii Booker who sang, \"Turned Away,\" Rockwell \"Somebody's watching me,\"  Kyper \"Tic-Tac Toe,\"  and of course Tajh from The Boys, \"Dial My Heart,\"  which was a really great music video by the way.", "summary": "Alexander, Luther, Chuckii, Kyper, Rockwell, and Tajh.", "unixReviewTime": 1357862400, "sentiment": "negative", "id": 1243}
{"verified": false, "reviewTime": "11 8, 2012", "reviewerID": "A3KZ7OH4VRL048", "asin": "B004EG0N8U", "style": {"Format:": " MP3 Music"}, "reviewText": "I was a bit skeptical when I saw the mix of artists on this track - I didn't think the four vocalists would gel at all. I could not have been more wrong. The song starts with the typical Jagger swagger before trading off lead vocals with Bono. What shocked me however was how Fergie absolutely slayed the \"Rape, Murder\" interlude while putting her own spin on it.\n\nHonestly, I think this is one of the best tracks to come out of the Rock & Roll Hall of Fame collaborations ever. Definitely worth the purchase.", "summary": "A great rendition of a classic", "unixReviewTime": 1352332800, "sentiment": "positive", "id": 1247}
{"verified": true, "reviewTime": "08 2, 2017", "reviewerID": "A1K8Q1LP31PGRQ", "asin": "B004EG6DK2", "style": {"Format:": " MP3 Music"}, "reviewText": "Song sucks", "summary": "Two Stars", "unixReviewTime": 1501632000, "sentiment": "negative", "id": 1251}
{"verified": true, "reviewTime": "04 28, 2017", "reviewerID": "A16DU9J2P5H2Z8", "asin": "B004EG86IO", "style": {"Format:": " MP3 Music"}, "reviewText": "No good.", "summary": "One Star", "unixReviewTime": 1493337600, "sentiment": "negative", "id": 1259}
{"verified": false, "reviewTime": "11 16, 2014", "reviewerID": "AOXN7AV33PHWX", "asin": "B004EG6OC4", "style": {"Format:": " MP3 Music"}, "reviewText": "Wow! What a bright forgotten gem this song is! Totally worth $1 to own the mp3. Don't think twice about it, just buy it.", "summary": "A forgotten gem! Buy it NOW!", "unixReviewTime": 1416096000, "sentiment": "positive", "id": 1263}
{"verified": true, "reviewTime": "08 13, 2015", "reviewerID": "A1Y4B4KNLZH3HB", "asin": "B004EG6DGG", "style": {"Format:": " MP3 Music"}, "reviewText": "For Whom the Bell Tolls is my absolute favorite song of all genres of music, and all bands, and I hated this cut of the song.  It is muddy and hard to listen to.  I am extremely disappointed.", "summary": "Not a good cut.", "unixReviewTime": 1439424000, "sentiment": "negative", "id": 1265}
{"verified": true, "reviewTime": "12 27, 2014", "reviewerID": "A1X05HDHWFDW0P", "asin": "B004EG6DGG", "style": {"Format:": " MP3 Music"}, "reviewText": "Sucks...", "summary": "One Star", "unixReviewTime": 1419638400, "sentiment": "negative", "id": 1267}
{"verified": false, "reviewTime": "07 16, 2014", "reviewerID": "A20G5YEPS8DGWO", "asin": "B004EG4TXU", "style": {"Format:": " MP3 Music"}, "reviewText": "What's not to love if Bruce is singing and playing.", "summary": "Five Stars", "unixReviewTime": 1405468800, "sentiment": "positive", "id": 1270}
{"verified": false, "reviewTime": "12 22, 2017", "reviewerID": "A2QEXUA9Y9AT87", "asin": "B004EG4G5G", "style": {"Format:": " MP3 Music"}, "reviewText": "This is a U2 song.  What the Hell?!!!!", "summary": "One Star", "unixReviewTime": 1513900800, "sentiment": "negative", "id": 1272}